Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/1-Introduction.po
Languages: tr

source: Introduction
tr: Giriş

source: In this document we cover the role of technology, especially artificial intelligence-based technology, on the preservation of endangered languages. This is a living document that was created as part of the project "Judeo-Spanish: Connecting the two ends of the Mediterranean" carried out by Col·lectivaT and Sephardic Center of Istanbul (SKAD) within the framework of the "Grant Scheme for Common Cultural Heritage: Preservation and Dialogue between Turkey and the EU–II (CCH-II)" implemented by the Ministry of Culture and Tourism of the Republic of Turkey with the financial support of the European Union.
tr: Bu belgede, nesli tükenmekte olan dillerin korunmasında teknolojinin, özellikle yapay zeka tabanlı teknolojinin rolünü ele alıyoruz. Bu, Col·lectivaT ve İstanbul Sefarad Merkezi (SKAD) tarafından yürütülen “Yahudi-İspanyolca: Akdeniz’in iki ucunu birbirine bağlamak” projesinin bir parçası olarak “Ortak için Hibe Programı” çerçevesinde oluşturulmuş yaşayan bir belgedir. Kültürel Mirasın Korunması ve Türkiye ile AB Arasında Diyalog–II (CCH-II)” Türkiye Cumhuriyeti Kültür ve Turizm Bakanlığı tarafından Avrupa Birliği’nin mali desteğiyle uygulanmaktadır.

source: The content of this website is the sole responsibility of Col·lectivaT and SKAD and does not necessarily reflect the views of the European Union.
tr: Bu web sitesinin içeriği yalnızca Col·lectivaT ve SKAD’ın sorumluluğundadır ve Avrupa Birliği’nin görüşlerini yansıtmayabilir.

source: The motivation
tr: Motivasyon

source: There is currently a growing digital divide between languages with sufficient resources and languages with fewer resources, further exacerbating the danger of digital extinction for them. For the majority languages, the process of generating useful tools and resources is much easier due to their large web-presence. However, many minority languages do not have sufficient material and human resources to power the creation of such tools. Lack of state support, public visibility, societal and institutional oppression are direct causes of these languages being deprioritized in the digital spaces of today.
tr: Şu anda, yeterli kaynağa sahip diller ile daha az kaynağa sahip diller arasında büyüyen bir dijital uçurum var ve bu, onlar için dijital yok olma tehlikesini daha da artırıyor. Çoğu dil için, geniş web varlıkları nedeniyle yararlı araçlar ve kaynaklar oluşturma süreci çok daha kolaydır. Bununla birlikte, birçok azınlık dili, bu tür araçların yaratılmasını sağlamak için yeterli maddi ve insan kaynağına sahip değildir. Devlet desteğinin olmaması, kamusal görünürlük, toplumsal ve kurumsal baskı, bu dillerin günümüzün dijital alanlarında önceliksizleştirilmesinin doğrudan nedenleridir.

source: Efforts on preservation of languages focus mainly on language documentation, teaching, and physical community building. One area that is overlooked is creation of tools based on artificial intelligence. Tools like machine translation, speech synthesis, and speech recognition are now important counterparts in creating human-machine interfaces. Also, these tools can help model the knowledge of dying languages and store them for future generations.
tr: Dillerin korunmasına yönelik çabalar, esas olarak dil dokümantasyonu, öğretimi ve fiziksel topluluk oluşturmaya odaklanır. Göz ardı edilen bir alan, yapay zekaya dayalı araçların oluşturulmasıdır. Makine çevirisi, konuşma sentezi ve konuşma tanıma gibi araçlar, artık insan-makine arayüzleri oluşturmada önemli eşdeğerlerdir. Ayrıca bu araçlar, ölmekte olan dillerin bilgisini modellemeye ve gelecek nesiller için saklamaya yardımcı olabilir.

source: Who is this document for?
tr: Bu belge kimin için?

source: This document is for you if you are:
tr: Aşağıdaki durumlarda bu belge sizin içindir:

source: Language activist who's interested in extending tools and resources in their language
tr: Kendi dillerinde araçları ve kaynakları genişletmekle ilgilenen dil aktivisti

source: Linguist who is interested in collecting data to power the creation of language technology
tr: Dil teknolojisinin yaratılmasına güç sağlamak için veri toplamakla ilgilenen dilbilimci

source: Natural language processing (NLP) researcher who is interested in augmenting data for their language of interest
tr: İlgilendikleri dil için verileri artırmakla ilgilenen doğal dil işleme (NLP) araştırmacısı

source: Language activist allies who want to support revitalization of local and global under-resourced languages
tr: Kaynakları yetersiz yerel ve küresel dillerin yeniden canlandırılmasını desteklemek isteyen dil aktivisti müttefikleri

source: Can I contribute?
tr: Katkıda bulunabilir miyim?

source: This is a living document with an open license (CC-BY). Its source file is shared publicly in https://github.com/CollectivaT-dev/language-toolkit where you can pull a version to work on your own and then submit your contribution. It can range from correcting typos, adding a translation, detailing a section, explaining your case study. If you have doubts please feel free to write to us at info@collectivat.cat.
tr: Bu, açık lisanslı (CC-BY) yaşayan bir belgedir. Kaynak dosyası https://github.com/CollectivaT-dev/language-toolkit adresinde herkese açık olarak paylaşılır, burada kendi başınıza çalışmak için bir sürüm çekebilir ve ardından katkınızı gönderebilirsiniz. Yazım hatalarını düzeltmeye, çeviri eklemeye, bir bölümü detaylandırmaya, vaka çalışmanızı açıklamaya kadar değişebilir. Herhangi bir şüpheniz varsa lütfen bize info@collectivat.cat adresinden yazmaktan çekinmeyin.

source: Authors
tr: Yazarlar
