Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/2-Digital age.po
Languages: es, tr

source: A digital font is the way computers know how to display the characters in your language. Unicode, formally the Unicode Standard, is an information technology standard for the consistent encoding, representation, and handling of text expressed in most of the world's writing systems. The standard, which is maintained by the Unicode Consortium, defines 144,697 characters covering 159 modern and historic scripts, as well as symbols, emoji, and non-visual control and formatting codes.
es: Una fuente digital es la forma en que los ordenadores saben cómo mostrar los caracteres en tu idioma. Unicode, formalmente el Unicode Standard, es una tecnología informática estándar para la codificación, representación y manejo consistentes del texto expresado en la mayoría de los sistemas de escritura del mundo. El estándar, mantenido por el Consorcio Unicode, define 144.697 caracteres que cubren 159 scripts modernos e históricos, así como símbolos, emojis y códigos de control y formato no visuales.
tr: Dijital yazı tipi, bilgisayarların karakterleri sizin dilinizde nasıl görüntüleyeceğini bilmelerinin yoludur. Unicode (Evrensel Kod), resmi adıyla *Unicode Standard*, dünyadaki çoğu yazım sistemlerinden metinlerin tutarlı bir şekilde kodlanması, gösterilmesi ve işlenmesi için oluşturulmuş bir bilgi teknolojisi standardıdır. Unicode Konsorsiyumu tarafından sürdürülen standart, 159 modern ve tarihi yazım sisteminin yanı sıra sembolleri, emojileri ve görsel olmayan kontrol ve biçimlendirme kodlarını içeren 144.697 karakteri tanımlar.

source: You can check if your language is supported by a font by going to `Google Noto <https://fonts.google.com/noto/>`_ and searching among fonts that represent more than 500 writing systems. If it is not there, you can create your own with the help from a font designer and install it manually on your computer.
es: Para comprobar si una fuente admite tu idioma, accede a `Google Noto <https://fonts.google.com/noto/>`_ y busca entre fuentes que representan más de 500 sistemas de escritura. Si no está allí, puedes crear su propia fuente con la ayuda de un/a diseñador/a de fuentes e instalarla manualmente en tu ordenador.
tr: `Google Noto <https://fonts.google.com/noto/>`_’ya giderek ve 500’den fazla yazı sistemini temsil eden yazı tipleri arasında arama yaparak dilinizin bir yazı tipi tarafından desteklenip desteklenmediğini kontrol edebilirsiniz. Eğer desteklenmiyorsa, bir yazı tipi tasarımcısının yardımıyla kendi diliniz için yazı tipi oluşturabilir ve manuel olarak bilgisayarınıza yükleyebilirsiniz.

source: Tifinagh alphabet of Moroccan Berber in Google Fonts
es: Alfabeto tifinagh de bereber marroquí en fuentes de Google
tr: Google Fonts’ta Fas Berberi Tifinag alfabesi

source: Keyboard
es: Teclado
tr: Klavye / Tuş takımı

source: Until the day we will be speaking naturally with computers, the most common interface for interacting with them will be the keyboard. It is a technology easily taken for granted for the world's many languages but unfortunately it is not available in all of the world's writing systems. If a keyboard is not present or not developed enough for a language, its speakers tend to prefer other alphabets or even languages to communicate. For example, speakers of Ethiopian languages like Amharic, Tigrinya and Oromo switch to using English as Ge'ez script is not pre-installed in their smartphones. Young arabic speakers in many countries have invented their own chat-alphabet `Arabizi <https://en.wikipedia.org/wiki/Arabic_chat_alphabet>`_ consisting of latin characters and numerals to account for the lack of Arabic script support in early mobile and web technology.
es: Hasta el día en que hablemos de forma natural con los ordenadores, la interfaz más común para interactuar con ellos será el teclado. Es una tecnología que fácilmente se da por descontada para muchos idiomas del mundo, pero desafortunadamente no está disponible en todos los sistemas de escritura del mundo. Si un teclado no existe o no está suficientemente desarrollado para un idioma, sus hablantes tienden a preferir otros alfabetos o incluso idiomas para comunicarse. Por ejemplo, los y las hablantes de idiomas etíopes como el amhárico, el tigrinya y el oromo cambian a usar el inglés porque el script ge'ez no está preinstalado en sus móviles inteligentes. Los jóvenes hablantes de árabe en muchos países han inventado su propio alfabeto de chat `Arabizi <https://en.wikipedia.org/wiki/Arabic_chat_alphabet>`_ que consiste en números y caracteres latinos para responder por la falta de soporte de escriptura árabe en la tecnología móvil y web temprana.
tr: Bilgisayarlarla doğal olarak konuşacağımız günler gelinceye kadar, onlarla iletişim kurmak için kullanacağımız en temel arayüz klavye olacaktır. Dünyadaki birçok dil için bulunmasına kolayca kesin gözüyle bakılan bir teknolojidir, ancak ne yazık ki dünyadaki tüm yazı sistemlerinde mevcut değildir. Eğer bir dil için geliştirilmiş bir klavye yoksa ya da yeterince gelişmemişse, o dili konuşanlar iletişim kurmak için diğer alfabeleri ve hatta dilleri tercih etme eğilimindedir. Örneğin, Amharca, Tigrinya ve Oromca gibi Etiyopya dillerini konuşanlar, akıllı telefonlarında Ge’ez alfabesi önceden yüklü olmadığı için, İngilizce kullanmaya geçerler. Birçok ülkede, Arapça konuşan gençler, eski mobil cihazlarda ve web teknolojilerinde Arap alfabesinin eksikliğini kapatmak için, Latin alfabesi karakterlerinden ve rakamlardan oluşan kendi *chat*-alfabeleri `Arabizi <https://en.wikipedia.org/wiki/Arabic_chat_alphabet>`_’yi icat ettiler.

source: If a keyboard is not available, let's say in your phone or computer, here are some resources to search or help create your own keyboard:
es: Si un teclado no está disponible, por ejemplo en tu teléfono u ordenador, aquí hay algunos recursos para buscar o ayudar a crear tu propio teclado:
tr: Telefonunuzda veya örneğin bilgisayarınızda size gerekli bir klavye mevcut değilse, bir klavyeyi aramanız veya kendi klavyesini oluşturmanıza yardımcı olacak bazı kaynaklar şunlar:

source: Google's mobile keyboard, `Gboard <https://support.google.com/gboard/answer/6380730?hl=en&ref_topic=9023832&co=GENIE.Platform%3DAndroid&oco=0>`_
es: Teclado móvil de Google, `Gboard <https://support.google.com/gboard/answer/6380730?hl=en&ref_topic=9023832&co=GENIE.Platform%3DAndroid&oco=0>`_
tr: Google’ın mobil klavyesi, `Gboard <https://support.google.com/gboard/answer/6380730?hl=tr&ref_topic=9023832&co=GENIE.Platform%3DAndroid&oco=0>`_

source: `Keyman <https://keyman.com/>`_ supports 2000 languages
es: `Keyman <https://keyman.com/>`_ soporta 2000 idiomas
tr: 2000 dili destekleyen `Keyman <https://keyman.com/>`_

source: `Ukelele <https://software.sil.org/ukelele/>`_ is a Unicode Keyboard Layout Editor for the MacOS
es: `Ukelele <https://software.sil.org/ukelele/>`_ es un editor de diseño de teclado Unicode para MacOS
tr: macOS için Unicode Klavye Düzeni Biçimleyicisi `Ukelele <https://software.sil.org/ukelele/>`_

source: Online dictionary
es: Diccionario en línea
tr: Çevrimiçi sözlük

source: A dictionary, or lexicon, is a solid way of documenting a language since it acts as a reference of words and their meanings. An online dictionary never goes out-of-print as it is accessible from any device with an internet connection. Also, open-source dictionaries can live and grow collaboratively as a community effort involving both speakers of the language, linguists and technologists.
es: Un diccionario, o léxico, es una forma sólida de documentar un lenguaje, ya que actúa como una referencia de las palabras y sus significados. Un diccionario en línea nunca se agota, ya que es accesible desde cualquier dispositivo con conexión a Internet. Además, los diccionarios de código abierto pueden vivir y crecer en colaboración como un esfuerzo comunitario que involucra tanto a hablantes de la lengua, lingüistas y tecnólogos.
tr: Sözlük (leksikon), bir dili belgelemenin önemli bir yoludur, çünkü kelimeler ve anlamları için bir referans görevi görür. İnternet bağlantısı olan herhangi bir cihazdan erişilebilir olduğu için, bir çevrimiçi sözlüğün baskısı asla tükenmez. Ayrıca, açık kaynak sözlükler, hem dili konuşanları, hem de dilbilimcileri ve teknoloji uzmanlarını içeren bir topluluğun çabasıyla ortaklaşa biçimde yaşatılabilir ve büyütülebilir.

source: `Living Dictionaries <https://livingdictionaries.app/>`_ is an online dictionary-builder platform created by Living Tongues Institute for Endangered Languages. It provides comprehensive, free online tech tools that assist language communities in conservation and revitalization efforts. It also allows recording of words and phrases. As of May 2022, it support 237 languages. To initiate your language in Living Dictionaries, you can get use of their `Elicitation lists <https://livingtongues.org/the-master-elicitation-list/>`_ and watch tutorials on their `YouTube channel <https://www.youtube.com/channel/UCiYtwIJ6yAgO2_IeLMgrirA>`_.
es: `Living Dictionaries <https://livingdictionaries.app/>`_ es una plataforma de creación de diccionarios en línea creada por Living Tongues Institute for Endangered Languages. Proporciona herramientas tecnológicas en línea completas y gratuitas que ayudan a las comunidades lingüísticas en los esfuerzos de conservación y revitalización. También permite el registro de palabras y frases. A partir de mayo de 2022, soporta 237 idiomas. Para iniciar su idioma en los diccionarios vivos, puede utilizar sus `Lista de elicitación <https://livingtongues.org/the-master-elicitation-list/>`_ y ver los tutoriales en su `canal de YouTube <https://www.youtube.com/channel/UCiYtwIJ6yAgO2_IeLMgrirA>`_.
tr: `Living Dictionaries <https://livingdictionaries.app/>`_ (Yaşayan Sözlükler), *Living Tongues Institute for Endangered Languages* (Tehlike Altındaki Diller için Yaşayan Diller Enstitüsü) tarafından oluşturulmuş bir çevrimiçi sözlük oluşturma platformudur. Dil topluluklarına dillerini koruma ve canlandırma çabalarında yardımcı olan kapsamlı, ücretsiz çevrimiçi teknoloji araçları sağlar. Ayrıca kelimelerin ve cümlelerin kaydedilmesine izin verir. Mayıs 2022 itibariyle 237 dili desteklemektedir. *Living Dictionaries*’de dilinizin sözlüğünü oluşturmaya başlamak için, `Tanımlama listeleri’nden <https://livingtongues.org/the-master-elicitation-list/>`_ yararlanabilir ve `YouTube kanallarındaki <https://www.youtube.com/channel/UCiYtwIJ6yAgO2_IeLMgrirA>`_ eğitim videolarını izleyebilirsiniz.

source: `SIL Dictionary App Builder <https://software.sil.org/dictionaryappbuilder/>`_ “helps you to build customized dictionary apps for Android and iOS smartphones and tablets. You specify the lexicon data file to use, the app name, fonts, colors, the ‘about box’ information, the audio, illustrations and the icons. Dictionary App Builder will package everything together and build the customized app for you. You can then install it on your phone, send it to others by Bluetooth, share it on microSD memory cards and publish it to app stores on the Internet.”
es: `SIL Dictionary App Builder <https://software.sil.org/dictionaryappbuilder/>`_ “le ayuda a crear aplicaciones de diccionario personalizadas para teléfonos inteligentes y tabletas Android e iOS. Especifique el archivo de datos de léxico que desea usar, el nombre de la aplicación, las fuentes, los colores, el audio, las ilustraciones y los iconos. Dictionary App Builder empaquetará todo y creará la aplicación personalizada para ti. A continuación, puede instalarlo en su teléfono, enviarlo a otros por Bluetooth, compartirlo en tarjetas de memoria microSD y publicarlo en tiendas de aplicaciones en Internet".
tr: `SIL Dictionary App Builder <https://software.sil.org/dictionaryappbuilder/>`_ “Android ve iOS akıllı telefonlar ve tabletler için özelleştirilmiş sözlük uygulamaları oluşturmanıza yardımcı olur. Kullanılacak sözlük veri dosyasını, uygulama adını, yazı tiplerini, renkleri, ‘hakkında’ bilgilerini, sesi, resimleri ve simgeleri siz belirlersiniz. Dictionary App Builder, her şeyi bir araya toplayıp sizin için özelleştirilmiş uygulamayı oluşturacaktır. Ardından uygulamayı telefonunuza yükleyebilir, Bluetooth ile başkalarına gönderebilir, microSD hafıza kartlarında paylaşabilir ve internetteki uygulama mağazalarında yayınlayabilirsiniz.”

source: A woman using bambara dictionary on her mobile phone
es: Una mujer usando el diccionario bambara en su teléfono móvil

source: A woman using Bambara dictionary on her mobile phone (image credit SIL International)
es: Una mujer usando el diccionario bambara en su teléfono móvil (crédito de la imagen SIL International)
tr: Cep telefonunda Bambara sözlüğü kullanan bir kadın (Görsel: SIL International)

source: Language learning applications
es: Aplicaciones de aprendizaje de idiomas
tr: Dil öğrenme uygulamaları

source: The availability of online educational platforms has revolutionized the way many people approach language learning today. Even though they don't replace a teacher, they either complement traditional classes or are the only choice in some languages' contexts. They also give many advantages like letting people learn on any device (mobile or desktop), at their own pace and schedule. These apps serve language classes and exercises in short, fun and digestible sprints, let the students track their progress, and even chat with or hire language tutors in online community spaces.
es: La disponibilidad de plataformas educativas en línea ha revolucionado la forma en que muchas personas abordan el aprendizaje de idiomas en la actualidad. A pesar de que no sustituyen a un profesor, complementan las clases tradicionales o son la única opción en los contextos de algunos idiomas. También ofrecen muchas ventajas, como permitir que las personas aprendan en cualquier dispositivo (móvil o de escritorio), a su propio ritmo y horario. Estas aplicaciones sirven clases de idiomas y ejercicios en sprints cortos, divertidos y digeribles, permiten a los estudiantes hacer un seguimiento de su progreso e incluso chatear o contratar tutores de idiomas en espacios comunitarios en línea.
tr: Çevrimiçi eğitim platformları, bugün birçok insanın dil öğrenmeye yaklaşım biçiminde devrim yarattı. Öğretmenin yerini tutmasalar da, bu platformlar ya geleneksel dersleri tamamlayıcı niteliktedir ya da bazı diller için tek seçenektir. Ayrıca, insanların herhangi bir cihazda (mobil veya masaüstü), kendi ilerleme hızlarında ve planlamalarında öğrenmelerini mümkün kılmak gibi birçok avantaj da sağlarlar. Bu uygulamalar, kısa, eğlenceli, hafif ve hızlı geçilen bölümlerle dil dersleri ve alıştırmalar sunar, öğrencilerin ilerlemelerini takip etmelerine, hatta çevrimiçi topluluk ortamlarında dil öğretmenleri ile sohbet etmelerine veya tutmalarına olanak verir.

source: Many of the world’s endangered, minority and under-resourced do not yet have a significant presence online or adequate language documentation to create online courses. There are, however, thanks to push from language communities and increased sensibility for learning indigenous languages worldwide, increased interest by companies who develop these apps for investing into endangered and minority languages. Languages like Maori, Scots Gaelic, Hawaiian, Quechua, Navajo and Lakota are making their way into well-known educational platforms like Duolingo, Babbel and uTalk.
es: Muchos de los grupos amenazados, minoritarios y de escasos recursos del mundo aún no tienen una presencia significativa en línea ni documentación lingüística adecuada para crear cursos en línea. Sin embargo, hay gracias al impulso de las comunidades lingüísticas y una mayor sensibilidad para el aprendizaje de idiomas indígenas en todo el mundo, un mayor interés por parte de las empresas que desarrollan estas aplicaciones para invertir en idiomas minoritarios y en peligro de extinción. Idiomas como maorí, gaélico escocés, hawaiano, quechua, navajo y lakota se están abriendo paso en plataformas educativas conocidas como Duolingo, Babbel y uTalk.
tr: Dünyada tehlike altında olan, azınlıklaştırılmış ve/veya yetersiz kaynaklara sahip olan dillerin çoğu, henüz çevrimiçi dil kursları oluşturmak için önemli bir çevrimiçi varlığa ya da yeterli dil belgelerine sahip değil. Bununla birlikte, dil topluluklarından gelen baskılar ve dünya çapında yerli dillerini öğrenmeye yönelik artan duyarlılık sayesinde, bu uygulamaları geliştiren şirketlerin tehlike altında olan dillere ve azınlık dillerine yatırım yapma konusundaki ilgisi arttı. Maorice, İskoçça, Hawaii, Keçuva, Navahoca ve Lakotaca gibi diller Duolingo, Babbel ve uTalk gibi tanınmış eğitim platformlarında yerlerini almaya başladı.

source: We can categorize these platforms in four ways:
es: Podemos categorizar estas plataformas de cuatro maneras:
tr: Bu platformları dört şekilde sınıflandırabiliriz:

source: **Module-based:** Using these apps feels more or less like taking a class in a school or a college, where users follow a modular curriculum planned by educators. It allows learners to track their progress, receive notifications, and earn points. Some notable examples are: `Duolingo <https://www.duolingo.com/>`_ , `Babbel <https://www.babbel.com/>`_, `uTalk <https://utalk.com/en/store>`_ , `Master Any Language <https://www.masteranylanguage.com/>`_. Unfortunately, it is not possible for language communities themselves to decide and implement a new language in these platforms. However, it is possible to "lobby" and participate in the creation of new modules through the communities some of these platforms provide. Also, it has to be noted that most of these platforms are in-profit platforms and the work by language communities remain uncompensated.
es: **Basado en módulos:** El uso de estas aplicaciones se siente más o menos como tomar una clase en una escuela o una universidad, donde los usuarios siguen un plan de estudios modular planificado por los educadores. Permite a los alumnos hacer un seguimiento de su progreso, recibir notificaciones y ganar puntos. Algunos ejemplos notables son: `Duolingo <https://www.duolingo.com/>`_ , `Babbel <https://www.babbel.com/>`_, `uTalk <https://utalk.com/en/store>`_ , `Master Any Language <https://www.masteranylanguage.com/>`_. Desafortunadamente, no es posible que las propias comunidades lingüísticas decidan e implementen un nuevo idioma en estas plataformas. Sin embargo, es posible "presionar" y participar en la creación de nuevos módulos a través de las comunidades que algunas de estas plataformas proporcionan. Además, hay que señalar que la mayoría de estas plataformas son plataformas con fines de lucro y el trabajo de las comunidades lingüísticas sigue sin ser compensado.
tr: **Modül tabanlı:** Bu uygulamaları kullanmak, bir okulda veya kursta ders almaya benzer. Kullanıcılar, eğitimciler tarafından planlanmış ve modüllerden oluşan bir müfredatı izler. Öğrencilerin ilerlemelerini takip etmelerine, bildirim almalarına ve puan kazanmalarına olanak tanır. Dikkate değer bazı örnekler şunlardır: `Duolingo <https://www.duolingo.com/>`_, `Babbel <https://www.babbel.com/>`_, `uTalk <https://utalk.com/en/store>`_, `Master Any Language <https://www.masteranylanguage.com/>`_. Ne yazık ki dil topluluklarının tek başına bu platformlara yeni bir dil eklenmesine ve kurulmasına karar vermesi mümkün değildir. Ancak, bu platformlardan bazılarının oluşturduğu topluluklara katılmak ve bunlar aracılığıyla yeni modüllerin oluşturulması için “lobi” yapmak mümkündür. Bu platformların çoğunun kar amacı güden platformlar olduğu ve ekonomik anlamda dil topluluklarının çalışmalarının karşılanmadığı dikkate alınmalıdır.

source: Content for learning Cree language in Master Any Language platform
es: Contenido para aprender el idioma cree en la plataforma Master Any Language
tr: Kri dilini öğrenmek için *Master Any Language* platformunda bir içerik
