Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/2-Digital age.po
Languages: es, tr

source: **Game-based:** These applications feed the learner with “question and answer” pairs and can evaluate how well the person memorizes the pairing over time. This method is popular online for visual as well as auditory learners of languages, and also for many other areas of study such as math and science. `Memrise <https://www.memrise.com/>`_ may be the most compelling for indigenous and other under-resourced minority languages. It is an online educational platform that uses memory techniques such as flashcards, SRS (spaced repetition software) and visual aids to optimise language learning. Memrise has content available for over 170 languages, a much greater number than most other language-learning platforms. Notably, the site has an impressive, community-created selection of content for indigenous languages and dialects from around the globe such as Yup’ik (see first screenshot below), Cherokee (see second screenshot below), Algonquian, Alutiiq, Choctaw, Greenlandic, Inuktitut, Lakota, Nahuatl, Yucatec Maya, K’iche’, Quechua, Guarani, Ainu, Jeju and many other medium-sized tongues spoken in Europe, Africa, the Middle East, Asia and the Pacific. The Memrise platform has a DIY, democratic and grassroots feeling to it. The platform is innovative because: 1) users can follow existing courses and flashcard sets and seamlessly upload their own mnemonic aids to help recall words and phrases as they progress through a course; 2) the site provides a engaging way for users to connect with language content through repetition, little quizzes, short videos, funny images and recordings made by fluent speakers, and 3) the platform allows community users to easily create their own language courses that others can use as well. Similar platforms include: `AnkiApp <https://www.ankiapp.com/>`_, `Language Drops <https://languagedrops.com/languages>`_, and `MosaLingua <https://www.mosalingua.com/en/>`_.
es: **Basado en juegos:** Estas aplicaciones alimentan al alumno con pares de "preguntas y respuestas" y pueden evaluar qué tan bien la persona memoriza el emparejamiento a lo largo del tiempo. Este método es popular en línea para los estudiantes visuales y auditivos de idiomas, y también para muchas otras áreas de estudio como las matemáticas y las ciencias. `Memrise <https://www.memrise.com/>`_ puede ser el más atractivo para las lenguas indígenas y otras lenguas minoritarias con recursos insuficientes. Se trata de una plataforma educativa online que utiliza técnicas de memoria como flashcards, SRS (software de repetición espaciada) y ayudas visuales para optimizar el aprendizaje de idiomas. Memrise tiene contenido disponible para más de 170 idiomas, un número mucho mayor que la mayoría de las otras plataformas de aprendizaje de idiomas. En particular, el sitio tiene una impresionante selección de contenido creado por la comunidad para lenguas y dialectos indígenas de todo el mundo, como Yup'ik (ver la primera captura de pantalla a continuación), Cherokee (ver la segunda captura de pantalla a continuación), Algonquian, Alutiiq, Choctaw, Groenlandia, Inuktitut, Lakota, Nahuatl, Yucatec Maya, K’ iche’, Quechua, Guaraní, Ainu, Jeju y muchas otras lenguas de tamaño mediano habladas en Europa, África, Oriente Medio, Asia y el Pacífico. La plataforma Memrise tiene un sentimiento de bricolaje, democrático y popular. La plataforma es innovadora porque: 1) los usuarios pueden seguir los cursos y conjuntos de tarjetas existentes y cargar sin problemas sus propias ayudas mnemotécnicas para ayudar a recordar palabras y frases a medida que avanzan a través de un curso; 2) el sitio proporciona una forma atractiva para que los usuarios se conecten con el contenido del idioma a través de la repetición, pequeños cuestionarios, videos cortos, imágenes divertidas y grabaciones hechas por hablantes fluidos, y 3) la plataforma permite a los usuarios de la comunidad crear fácilmente sus propios cursos de idiomas que otros también pueden usar. Las plataformas similares incluyen: `AnkiApp <https://www.ankiapp.com/>`_, `Language Drops <https://languagedrops.com/languages >`_y `MosaLingua <https://www.mosalingua.com/en/>`_.
tr: **Oyun tabanlı:** Bu uygulamalar öğrenciye “soru-cevap” eşleştirmeleri verir ve kişinin zaman içinde eşleştirmeyi ne kadar iyi ezberlediğini değerlendirebilir. Bu yöntem, görsel ve işitsel yöntemlerle dil öğrenenler tarafından çevrimiçi popüler seçeneklerden biridir. Ayrıca matematik ve fen gibi diğer birçok çalışma alanı için de kullanılır. `Memrise <https://www.memrise.com/>`_, yerli dilleri ve diğer yetersiz kaynaklara sahip azınlık dilleri için en çekici uygulamalardan biri olabilir. Dil öğrenimini optimize etmek için, bilgi kartları, aralıklı tekrarlama ve görsel araçlar gibi hafıza tekniklerini kullanan çevrimiçi bir eğitim platformudur. Memrise’da, 170’in üzerinde dilde içerik bulunur, bu sayı diğer dil öğrenme platformlarının çoğundan çok daha yüksektir. Site, takdire değer şekilde, özellikle dünyanın dört bir yanında konuşulan yerli dilleri ve lehçeleri için, o dillerin toplulukları tarafından oluşturulmuş etkileyici bir içerik seçkisine sahiptir: Yupik (bkz alttaki ilk ekran görüntüsü), Çeroki (bkz alttaki ikinci ekran görüntüsü), Algonkin, Supik, Çoktav, Grönland, İnuit, Lakota, Nahuatl, Yukatek Maya, Kiçe, Keçuva, Guarani, Aynu, Jeju dilleri, ve Avrupa, Afrika, Orta Doğu, Asya ve Pasifik’te konuşulan diğer birçok orta ölçekli diller. Memrise, "kendin yapçı" (*DIY*), demokratik ve tabandan gelen bir platform hissi veriyor. Memrise yenilikçi bir platform; çünkü: 1) kullanıcılar hali hazırdaki kursları ve bilgi kartı setlerini takip edebiliyor ve bir kursta ilerlerken kelimeleri ve cümleleri hatırlamaya yardımcı olmak için kendi anımsatıcı araçlarını sorunsuz bir şekilde yükleyebiliyor; 2) site, tekrarlar, küçük testler, kısa videolar, eğlenceli görüntüler ve ileri seviye konuşmacılar tarafından hazırlanmış kayıtlar aracılığıyla kullanıcıların dil içeriğiyle bağlantı kurmaları için ilgi çekici bir yol sağlıyor; ve 3) platform, bir topluluğun kullanıcılarının kendi dillerinde, kolayca ve başkalarının da kullanabileceği dil kursları oluşturmalarına olanak tanıyor. Buna benzer platformlar şunlar: `AnkiApp <https://www.ankiapp.com/>`_, `Language Drops <https://languagedrops.com/languages>`_, ve `MosaLingua <https://www.mosalingua.com/en/>`_.

source: Community created Quechua learning exercises in Memrise
es: Ejercicios de aprendizaje de quechua creados por la comunidad en Memrise
tr: Memris’te topluluk tarafından oluşturulmuş Keçuva öğrenme alıştırmaları

source: **Chat-based:** These apps allow learners to connect with spakers of the language they are interested in through a live interactive chat. This provides a stress-free and social environment for learners. Some examples like `HiNative <https://hinative.com>`_ and `HelloTalk <https://www.hellotalk.com/>`_ have recently exploded in popularity especially in Asian contries.
es: **Basado en chat:** Estas aplicaciones permiten a los alumnos conectarse con hablantes del idioma que les interesa a través de un chat interactivo en vivo. Esto proporciona un entorno social y libre de estrés para los alumnos. Algunos ejemplos como `HiNative <https://hinative.com>`_ y `HelloTalk <https://www.hellotalk.com/>`_ han aumentado recientemente en popularidad, especialmente en países asiáticos.
tr: **Sohbet tabanlı:** Bu uygulamalar, öğrencilerin interaktif bir canlı sohbet aracılığıyla ilgilerini çeken dili konuşanlarla bağlantı kurmasına olanak tanır. Bu, öğrenciler için stressiz ve sosyal bir ortam sağlar. `HiNative <https://hinative.com>`_ ve `HelloTalk <https://www.hellotalk.com/>`_ gibi bazı örnekler son zamanlarda özellikle Asya ülkelerinde popülerlik kazandı.

source: **Online student-tutor platforms:** For those learners who prefer classic teacher-student relationship but do not have access to teachers in their vicinity, platforms like `iTalki <https://www.italki.com/>`_ and `Verbling <https://www.verbling.com/>`_ help setup online classes. This also contributes directly to the language community as it generates direct income for the teachers.
es: **Plataformas de tutoría estudiantil en línea:** Para aquellos estudiantes que prefieren la relación clásica profesor-alumno pero no tienen acceso a los maestros en su entorno, plataformas como `iTalki <https://www.italki.com/>`_ y `Verbling <https://www.verbling.com/>`_ ayudan a configurar clases en línea. Esto también contribuye directamente a la comunidad lingüística, ya que genera ingresos directos para los profesores.
tr: **Çevrimiçi öğrenci-öğretmen platformları:** Klasik öğretmen-öğrenci ilişkisini tercih eden ancak yakınlarda bir öğretmene erişimi olmayan öğrenciler için, `iTalki <https://www.italki.com/>`_ ve `Verbling <https://www.verbling.com/>`_ gibi platformlar çevrimiçi derslerin ayarlanmasına yardımcı olur. Bu aynı zamanda, öğretmenler için doğrudan gelir sağladığı için, doğrudan dil topluluğuna da katkıda bulunur.

source: Sources
es: Fuentes
tr: Kaynaklar

source: `Catalan wikipedia on Wikipedia <https://en.wikipedia.org/wiki/Catalan_Wikipedia>`_
es: `Wikipedia catalana en Wikipedia <https://en.wikipedia.org/wiki/Catalan_Wikipedia>`_
tr: `Wikipedia’da Katalan Vikipedi <https://en.wikipedia.org/wiki/Catalan_Wikipedia>`_

source: `How Technology Can Save Rapidly Dying Languages <https://www.vocativ.com/news/360216/apps-dying-languages/index.html>`_
es: `Cómo la tecnología puede ahorrar idiomas que mueren rápidamente <https://www.vocativ.com/news/360216/apps-dying-languages/index.html>`_

source: `Unicode on Wikipedia <https://en.wikipedia.org/wiki/Unicode>`_
es: `Unicode en Wikipedia <https://en.wikipedia.org/wiki/Unicode>`_
tr: `Wikipedia’da Unicode <https://en.wikipedia.org/wiki/Unicode>`_

source: `Computer assisted language learning in Wikipedia <https://en.wikipedia.org/wiki/Computer-assisted_language_learning#Human_language_technologies>`_
es: `Aprendizaje asistido por ordenador en Wikipedia <https://en.wikipedia.org/wiki/Computer-assisted_language_learning#Human_language_technologies>`_
tr: `Wikipedia’da bilgisayar destekli dil öğrenimi <https://en.wikipedia.org/wiki/Computer-help_language_learning#Human_language_technologies>`_

source: This document was created with the financial support of the European Union. The content of this website is the sole responsibility of Col·lectivaT and SKAD and does not necessarily reflect the views of the European Union.
es: Este documento fue creado con el apoyo financiero de la Unión Europea. El contenido de este sitio web es responsabilidad exclusiva de Col·lectivaT y SKAD, y no refleja necesariamente las opiniones de la Unión Europea.
tr: Bu yayın Avrupa Birliğinin maddi desteği ile hazırlanmıştır. İçerik tamamıyla Col·lectivaT ve SKAD’ın sorumluluğundadır ve Avrupa Birliği’nin görüşlerini yansıtmak zorunda değildir.

source: `Microsoft Keyboard Layout Creator <https://www.microsoft.com/en-us/download/details.aspx?id=102134>`_
tr: `Microsoft Klavye Düzeni Oluşturucu (MSKLC) <https://www.microsoft.com/en-us/download/details.aspx?id=102134>`_

source: `Language sustainability toolkit <https://wikitongues.org/toolkit/>`_
tr: `Dil sürdürülebilirliği araç seti <https://wikitongues.org/toolkit/>`_

source: `Learn Language Online by Living Tongues <https://livingtongues.org/learn-languages-online/>`_
tr: `Learn Language Online - Living Tongues <https://livingtongues.org/learn-languages-online/>`_
