Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/4-Language data.po
Languages: es, tr

source: `Common Voice <https://commonvoice.mozilla.org/>`_ is a crowdsourcing project started by Mozilla to create a free database for making speech recognition accessible to everyone. The project is supported by volunteers who record sample sentences with a microphone and review recordings of other users. The voiced samples are released in regular intervals under the public domain license CC0 (`public domain <https://en.wikipedia.org/wiki/Public_domain>`_). This license ensures that developers can use the database for voice-to-text applications without restrictions or costs.
es: `Common Voice <https://commonvoice.mozilla.org/>`_ es un proyecto de crowdsourcing iniciado por Mozilla para crear una base de datos gratuita para hacer que el reconocimiento de voz sea accesible para todos. El proyecto cuenta con el apoyo de voluntarios que registran oraciones de muestra con un micrófono y revisan las grabaciones de otros usuarios. Las muestras con voz se publican a intervalos regulares bajo la licencia de dominio público CC0 (`dominio público <https://en.wikipedia.org/wiki/Public_domain>`_). Esta licencia garantiza que los desarrolladores puedan utilizar la base de datos para aplicaciones de voz a texto sin restricciones ni costes.
tr: `Common Voice <https://commonvoice.mozilla.org/>`_, konuşma tanımayı herkes için erişilebilir kılmak için ücretsiz bir veritabanı oluşturmak amacıyla Mozilla tarafından başlatılan bir kitle kaynaklı projedir. Proje, mikrofonla örnek cümleler kaydeden ve diğer kullanıcıların kayıtlarını inceleyen gönüllüler tarafından destekleniyor. Seslendirilmiş örnekler, CC0 kamu malı lisansı (`public domain <https://en.wikipedia.org/wiki/Public_domain>`_) altında düzenli aralıklarla yayınlanır. Bu lisans, geliştiricilerin veritabanını sesten metne uygulamalar için kısıtlama veya maliyet olmaksızın kullanabilmelerini sağlar.

source: As of May 2022, Common Voice supports 63 languages with 68 new on the way. Check here the current list of languages: https://commonvoice.mozilla.org/en/languages.
es: A partir de mayo de 2022, Common Voice admite 63 idiomas con 68 nuevos en camino. Consulta aquí la lista actual de idiomas: https://commonvoice.mozilla.org/en/languages.
tr: Mayıs 2022 itibarıyla Common Voice, 68 yeni dil ile birlikte 63 dili desteklemektedir. Burada mevcut dil listesine bakın: https://commonvoice.mozilla.org/en/languages.

source: Recording a Kurmanji Kurdish sentence on Common Voice
es: Grabación de una sentencia kurda Kurmanji en Common Voice
tr: Common Voice’a Kurmanci Kürtçe bir cümle kaydetme

source: Adding a language to Common Voice
es: Añadir un idioma a Common Voice
tr: Common Voice’a dil ekleme

source: Common Voice works as a community platform where each language has their own community. The procedure for adding a new language into Common Voice is as follows:
es: Common Voice funciona como una plataforma comunitaria donde cada idioma tiene su propia comunidad. El procedimiento para añadir un nuevo lenguaje en Common Voice es el siguiente:
tr: Common Voice, her dilin kendi topluluğuna sahip olduğu bir topluluk platformu olarak çalışır. Common Voice’a yeni bir dilin eklenmesi prosedürü aşağıdaki gibidir:

source: **Find a community manager for the language** (`Information on roles <https://mozilla-l10n.github.io/localizer-documentation/community/l10n_community_roles.html>`_)
es: **Encuentre un administrador de la comunidad para el idioma** (`Información sobre roles <https://mozilla-l10n.github.io/localizer-documentation/community/l10n_community_roles.html>`_)
tr: Dil için bir topluluk yöneticisi bulma (`Roller hakkında bilgi <https://mozilla-l10n.github.io/localizer-documentation/community/l10n_community_roles.html>`_)

source: **Localization request to Mozilla** This is done using `this template <https://github.com/common-voice/common-voice/issues/new?assignees=phirework&labels=&template=language_request.md&title=LOCALIZATION+REQUEST%3A+>`_ on their github page. This will start the localization process of Common Voice to the desired language by placing it on Pontoon.
es: **Solicitud de localización a Mozilla** Esto se hace utilizando `esta plantilla <https://github.com/common-voice/common-voice/issues/new?assignees=phirework&labels=&template=language_request.md&title=LOCALIZACIÓN+SOLICITUD%3A+>`_ en su página de github. Esto iniciará el proceso de localización de Common Voice al idioma deseado colocándolo en Pontoon.
tr: Mozilla’ya yerelleştirme isteği. Bu, github sayfalarında `bu şablon <https://github.com/common-voice/common-voice/issues/new?assignees=phirework&labels=&template=language_request.md&title=LOCALIZATION+REQUEST%3A+>`_ kullanılarak yapılır . Bu, Common Voice’u Pontoon’a yerleştirerek istenen dile yerelleştirme sürecini başlatacaktır.

source: **Localization on Pontoon** (`user manual <https://mozilla-l10n.github.io/localizer-documentation/tools/pontoon/index.html>`_) Every string on Common Voice platform needs to be translated to the language respecting the style guide. In total there are 663 strings. Translations can be made by any speaker who registers to the platform, but they need to be reviewed by the community manager.
es: **Localización en Pontoon** (`manual de usuario <https://mozilla-l10n.github.io/localizer-documentation/tools/pontoon/index.html>`_) Cada cadena en la plataforma Common Voice necesita ser traducida al idioma respetando la guía de estilo. En total hay 663 cuerdas. Las traducciones pueden ser realizadas por cualquier orador que se registre en la plataforma, pero deben ser revisadas por el administrador de la comunidad.
tr: Pontoon’da yerelleştirme (`kullanım kılavuzu <https://mozilla-l10n.github.io/localizer-documentation/tools/pontoon/index.html>`_). Common Voice platformundaki her dize, stil kılavuzuna uygun dile çevrilmelidir. Toplamda 663 dize var. Çeviriler, platforma kaydolan herhangi bir konuşmacı tarafından yapılabilir, ancak bunların topluluk yöneticisi tarafından gözden geçirilmesi gerekir.

source: **Sentence collection** A minimum of 5000 public domain sentences needs to be collected and entered to `Common Voice sentence collector <https://commonvoice.mozilla.org/sentence-collector>`_.
es: **Recopilación de oraciones** Se debe recopilar un mínimo de 5000 oraciones de dominio público e ingresar a `Common Voice sentence Collector <https://commonvoice.mozilla.org/sentence-collector>`_.
tr: Cümle koleksiyonu. En az 5000 kamu malı cümlenin toplanması ve `Common Voice cümle toplayıcı <https://commonvoice.mozilla.org/sentence-collector>` a girilmesi gerekir.

source: **Reviewing sentences** Each collected sentence needs to be reviewed manually by at least two users on sentence collector.
es: **Revisar frases** Cada frase recopilada debe ser revisada manualmente por al menos dos usuarios en el recopilador de oraciones.
tr: Cümleleri gözden geçirmek. Toplanan her cümle, cümle toplayıcıda en az iki kullanıcı tarafından manuel olarak incelenmelidir.

source: **Wait for next CV release** Once localization is complete and there are 5000 reviewed sentences, next CV release should contain your language. Releases are done done twice a month with schedules listed on `their github repository <https://github.com/common-voice/common-voice>`_.
es: **Espere a la próxima versión del CV** Una vez que se complete la localización y haya 5000 oraciones revisadas, la próxima versión del CV debe contener su idioma. Los lanzamientos se realizan dos veces al mes con los horarios listados en `su repositorio de github <https://github.com/common-voice/common-voice>`_.
tr: Bir sonraki CV yayınını bekleyin. Yerelleştirme tamamlandığında ve gözden geçirilmiş 5000 cümle olduğunda, bir sonraki özgeçmiş yayınında dilinizi içermelidir. Yayınlar ayda iki kez `github deposunda <https://github.com/common-voice/common-voice>` listelenen programlarla yapılır.

source: Found data
es: Datos encontrados
tr: Bulumuş veriler

source: It is also possible to source voice data from broadcast radio shows, movies and other recorded material like interviews. This type of data is called "found data" as it is not originally intended to serve for builing voice technology but it is *repurposed* to do so. Found data requires to be processed in order to obtain short audio segments and their transcriptions.
es: También es posible obtener datos de voz de programas de radiodifusión, películas y otros materiales grabados, como entrevistas. Este tipo de datos se denomina "datos encontrados", ya que originalmente no está destinado a servir para construir tecnología de voz, sino que *se reutiliza* para hacerlo. Los datos encontrados requieren ser procesados para obtener segmentos de audio cortos y sus transcripciones.
tr: Ayrıca, radyo programlarından, filmlerden ve röportajlar gibi kayıtlı materyallerden ses verileri elde etmek de mümkündür. Bu tür veriler, orijinal olarak ses teknolojisi oluşturmaya hizmet etmesi amaçlanmadığı için “bulunmuş veriler” olarak adlandırılır, ancak *yeniden amaçlanır*. böyle yap. Bulunan verilerin kısa ses segmentleri ve bunların transkripsiyonlarını elde etmek için işlenmesi gerekir.

source: Sources
es: Fuentes
tr: Kaynaklar

source: `Text corpus in Wikipedia <https://en.wikipedia.org/wiki/Text_corpus>`_
es: `Corpus de texto en Wikipedia <https://en.wikipedia.org/wiki/Text_corpus>`_
tr: `Wikipedia’daki metin derlemi <https://en.wikipedia.org/wiki/Text_corpus>`_

source: `Tatoeba in Wikipedia <https://en.wikipedia.org/wiki/Tatoeba>`_
es: `Tatoeba en Wikipedia <https://en.wikipedia.org/wiki/Tatoeba>`_
tr: `Vikipedi’de Tatoeba <https://en.wikipedia.org/wiki/Tatoeba>`_

source: `Speech corpus in Wikipedia <https://en.wikipedia.org/wiki/Speech_corpus>`_
tr: `Wikipedia’da konuşma derlemi <https://en.wikipedia.org/wiki/Speech_corpus>`_

source: `Common Voice in Wikipedia <https://en.wikipedia.org/wiki/Common_Voice>`_
es: `Common Voice en Wikipedia <https://en.wikipedia.org/wiki/Common_Voice>`_
tr: `Wikipedia’da Common Voice <https://en.wikipedia.org/wiki/Common_Voice>`_

source: This document was created with the financial support of the European Union. The content of this website is the sole responsibility of Col·lectivaT and SKAD and does not necessarily reflect the views of the European Union.
es: Este documento fue creado con el apoyo financiero de la Unión Europea. El contenido de este sitio web es responsabilidad exclusiva de Col·lectivaT y SKAD, y no refleja necesariamente las opiniones de la Unión Europea.
tr: Bu belge Avrupa Birliği’nin mali desteğiyle oluşturulmuştur. Bu web sitesinin içeriği yalnızca Col·lectivaT ve SKAD’ın sorumluluğundadır ve Avrupa Birliği’nin görüşlerini yansıtmayabilir.
