Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/4-Language data.po
Languages: es, tr

source: Turkey and European Union flags
es: Banderas de Turquía y de la Unión Europea
tr: Türkiye ve Avrupa Birliği bayrakları

source: This project is funded by the European Union.
es: Este proyecto está financiado por la Unión Europea.
tr: Bu proje Avrupa Birliği tarafından finanse edilmiştir.

source: Language data
es: Datos lingüísticos
tr: Dil verileri

source: Artificial intelligence tools opens up a new area for language resource creation for endangered and minority languages. Compared to the "classic" language resources created to preserve languages like lexica, grammar documentation, language maps etc., these require less linguistic expertise but are usually only useful in large volumes.
es: Las herramientas de inteligencia artificial abren una nueva área para la creación de recursos lingüísticos para las lenguas minoritarias y en peligro de extinción. En comparación con los recursos lingüísticos "clásicos" creados para preservar idiomas como la léxica, la documentación gramatical, los mapas lingüísticos, etc., estos requieren menos conocimientos lingüísticos, pero por lo general solo son útiles en grandes volúmenes.
tr: Yapay zeka (AI) araçları, tehlike altındaki diller ve azınlık dilleri için dil kaynağı oluşturma adına yeni bir alan açar. Sözlük, dil bilgisi belgeleri, dil haritaları vb. gibi dilleri korumak için oluşturulan “klasik” dil kaynaklarıyla karşılaştırıldığında, AI araçları daha az dilbilimsel uzmanlık gerektirir, ancak genellikle yalnızca büyük hacimlerde olduğunda yararlıdır.

source: In this section we will explain the types of data that power the creation of artificial intelligence-based language technology explained in the previous chapter. Also, we will cover some ways to collect them and get the most out of them even if they are not of large volumes usually required by these applications.
es: En esta sección explicaremos los tipos de datos que impulsan la creación de tecnología del lenguaje basada en inteligencia artificial explicada en el capítulo anterior. Además, cubriremos algunas formas de recopilarlos y obtener el máximo provecho de ellos, incluso si no son de grandes volúmenes que suelen requerir estas aplicaciones.
tr: Bu bölümde, bir önceki bölümde anlattığımız yapay zeka tabanlı dil teknolojilerinin oluşturulmasını besleyen veri türlerini açıklayacağız. Ayrıca, genellikle bu uygulamaların gerektirdiği gibi büyük hacimli olmasalar bile, bu verileri toplamanın ve bunlardan en iyi şekilde yararlanmanın bazı yollarını ele alacağız.

source: Text corpus
es: Corpus de texto
tr: Metin derlemi

source: In linguistics, a corpus (plural corpora) or text corpus is a language resource consisting of a large and structured set of texts in a language in digital format. They are useful in corpus linguistics for doing statistical analysis and hypothesis testing, checking occurrences or validating linguistic rules within a specific language territory. For language technology, they are an essential part in creating statistical language models that are used in applications such as optical character recognition, handwriting recognition, machine translation, spelling correction and assisted writing.
es: En lingüística, un corpus (corpus plural) o corpus de texto es un recurso lingüístico que consiste en un conjunto grande y estructurado de textos en un idioma en formato digital. Son útiles en lingüística de corpus para hacer análisis estadísticos y pruebas de hipótesis, verificar ocurrencias o validar reglas lingüísticas dentro de un territorio lingüístico específico. Para la tecnología del lenguaje, son una parte esencial en la creación de modelos de lenguaje estadísticos que se utilizan en aplicaciones como el reconocimiento óptico de caracteres, el reconocimiento de escritura a mano, la traducción automática, la corrección ortográfica y la escritura asistida.
tr: Dilbilimde, bir metin derlemi (İng. *text corpus*/*corpora*), bir dilde dijital formatta büyük ve yapılandırılmış bir metin kümesinden oluşan bir dil kaynağıdır. Derlem dilbiliminde (*corpus linguistics*) metin derlemlerinden, istatistiksel analiz yapmak ve hipotezi test etmek, oluşumları kontrol etmek veya belirli bir dil bölgesi içindeki dil kurallarını doğrulamak için faydalanılır. Dil teknolojileri açısından, optik karakter tanıma, el yazısı tanıma, makine çevirisi, yazım hataları düzeltme, bilgisayar destekli yazım gibi uygulamalarda kullanılan istatistiksel dil modellerinin oluşturulmasında önemli bir rol oynarlar.

source: Text corpora by themselves are of the type *unlabeled data*. That is, they are a mere collection of data (in this case text) without any annotations or labelling. Language models store the probabilities of sequences words in order to get an "understanding" for the language. Also, text corpora can be annotated with following information in order to create *labeled data* for different NLP tasks:
es: Los corpus de texto por sí mismos son del tipo * datos sin etiquetar *. Es decir, son una mera recopilación de datos (en este caso texto) sin anotaciones ni etiquetado. Los modelos de lenguaje almacenan las probabilidades de secuencias de palabras para obtener una "comprensión" del lenguaje. Además, los corpus de texto se pueden anotar con la siguiente información para crear * datos etiquetados * para diferentes tareas de PNL:
tr: Metin derlemleri kendi başlarına *etiketlenmemiş veri* türündedir. Yani, sadece bir veri yığınıdır (bu durumda metin), herhangi bir açıklama veya etiket içermez. Dil modelleri, dille ilgili bir “fikir edinmek” için kelime dizilerinin olasılıklarını depolar. Ayrıca, farklı NLP görevleri için *etiketli veriler* oluşturmak amacıyla metin derlemlerine aşağıdaki açıklamalar eklenebilir:

source: **Part-of-speech** (Noun, verb, Adjective etc.)
es: **Parte del discurso** (sustantivo, verbo, adjetivo, etc.)
tr: **Sözcük türü** (İsim, fiil, Sıfat vb.)

source: **Named entities** (Person, location, personally identifiable information, organization, time etc.)
es: **Entidades nombradas** (Persona, ubicación, información de identificación personal, organización, hora, etc.)
tr: **Adlandırılmış varlıklar** (Kişi, konum, kişisel olarak tanımlanabilir bilgiler, kurum, zaman vb.)

source: **Lemmas** (roots of the words e.g. break for broken)
es: **Lemas** (raíces de las palabras, por ejemplo, venir por venga)
tr: **Lemma** (kelime kökleri, ör. kırdı için kırmak gibi)

source: **Dependency and phrase structure** (syntactic tree)
es: **Estructura de dependencia y frase** (árbol sintáctico)
tr: **Bağımlılık ve öbek yapısı** (sözdizimi ağacı)

source: Sourcing text corpora
es: Obtención de corpus de texto
tr: Metin derlemlerine kaynak sağlama

source: The most common way of sourcing text corpora is through *crawling* the world wide web. This technique parses the whole web for collecting text in a certain language or many languages at once. Wikipedia `publishes its content <https://en.wikipedia.org/wiki/Wikipedia:Database_download>`_ in different languages which can be used to create text corpora. `Common Crawl <https://commoncrawl.org/>`_ initiative collects web site data and freely provides petabytes of data. OSCAR distributes this data classified into 166 languages.
es: La forma más común de obtener corpus de texto es a través de *rastreo* de la World Wide Web. Esta técnica analiza toda la web para recopilar texto en un idioma determinado o en muchos idiomas a la vez. Wikipedia `publica su contenido <https://en.wikipedia.org/wiki/Wikipedia:Database_download>`_ en diferentes idiomas que se pueden utilizar para crear corpus de texto. `Common Crawl <https://commoncrawl.org/>`_ initiative recopila datos del sitio web y proporciona libremente petabytes de datos. OSCAR distribuye estos datos clasificados en 166 idiomas.
tr: Metin derlemine kaynak sağlamanın en yaygın yolu, web’i *taramak*tır. Bu teknik, aynı anda belirli bir dilde veya birçok dilde metin toplamak için tüm web’i ayrıştırır (*parse*). Örneğin Wikipedia, içeriğini farklı dillerde `yayınlar <https://en.wikipedia.org/wiki/Wikipedia:Database_download>`_, bu da bir metin derlemi oluşturmak için kullanıblabilir. `Common Crawl <https://commoncrawl.org/>`_ inisiyatifi, web sitesi verilerini toplar ve halka petabaytlarca (1 PB=1024 terrabayt) veriyi ücretsiz olarak sağlar. OSCAR, bu verileri 166 dilde sınıflandırararak dağıtır.

source: Another common resource used by resourceful languages are books. `BookCorpus <https://yknzhu.wixsite.com/mbweb>`_ consists of 11,038 books from the web containing 74 Million sentences and 984 Million words and is known to have powered many influential language models by big tech companies.
es: Otro recurso común utilizado por los idiomas ingeniosos son los libros. `BookCorpus <https://yknzhu.wixsite.com/mbweb>`_ consta de 11.038 libros de la web que contienen 74 millones de frases y 984 millones de palabras y se sabe que ha impulsado muchos modelos de lenguaje influyentes por las grandes empresas tecnológicas.
tr: Kaynağı olan diller için kullanılan bir diğer yaygın kaynak ise kitaplardır. `BookCorpus <https://yknzhu.wixsite.com/mbweb>`_ web’den 74 Milyon cümle ve 984 Milyon kelime içeren 11.038 kitaptan oluşuyor ve büyük teknoloji şirketlerinin oluşturduğu birçok etki yaratan dil modelini desteklediği biliniyor.

source: Language models that are created from data in the wild represent what they see, and nothing else. Language in the web and books contain as well biases, toxic language which eventually gets replicated in these models. For an analysis of potential risks of building language models out of big language corpora, refer to `this paper by Bender et al. <https://dl.acm.org/doi/abs/10.1145/3442188.3445922>`_
es: Los modelos de lenguaje que se crean a partir de datos en la naturaleza representan lo que ven, y nada más. El lenguaje en la web y los libros también contienen sesgos, lenguaje tóxico que eventualmente se replica en estos modelos. Para un análisis de los riesgos potenciales de construir modelos de lenguaje a partir de grandes corpus de lenguaje, consulte `este artículo de Bender et al. <https://dl.acm.org/doi/abs/10.1145/3442188.3445922>`_
tr: Web’de ve kitaplardaki dil/üslup önyargı ya da toksik dil içerir. Buralarda açıkta bulunan verilerden oluşturulan dil modelleri, gördüklerini temsil etmekten başka bir şey yapmaz. Dolayısıyla bu üsluplar, modellerde yeniden üretilir. Büyük dil derlemlerinden dil modelleri oluşturmanın olası risklerinin analizi için, `Bender et al. tarafından yazılan bu makaleye <https://dl.acm.org/doi/abs/10.1145/3442188.3445922>`_ bakabilirsiniz.

source: Parallel data (bitext)
es: Datos paralelos (bitext)
tr: Paralel veri (bitext)

source: The type of data that is needed to build a machine translation system is parallel data, which consists of a collection of sentences in a language together with their translations. Historically, parallel data were sourced from translations in multilingual public spaces like United Nations, European Parliament. Now, the greatest resource of parallel text is the multilingual web.
es: El tipo de datos que se necesitan para construir un sistema de traducción automática son datos paralelos, que consisten en una colección de oraciones en un idioma junto con sus traducciones. Históricamente, los datos paralelos se obtuvieron de traducciones en espacios públicos multilingües como las Naciones Unidas y el Parlamento Europeo. Ahora, el mayor recurso de texto paralelo es la web multilingüe.
tr: Bir makine çeviri sistemi oluşturmak için ihtiyaç duyulan veri türü, bir dildeki tümcelerin çevirileriyle birlikte bir araya gelmesinden oluşan paralel veridir. Tarihsel olarak paralel veriler, Birleşmiş Milletler, Avrupa Parlamentosu gibi çok dilli parlamentolardaki çevirilerden alınmıştır. Şimdi, paralel metnin en büyük kaynağı çok dilli ağdır.

source: In order to train machine translation models it is not enough just to have translated documents. The texts need to be segmented to sentences and aligned. Parallel text alignment is the identification of the corresponding sentences in both sides of the parallel text. The resulting documents either have to correspond line by line or contain the original sentences and their translations in the same line. `Hunalign <https://github.com/danielvarga/hunalign>`_ helps in creating sentence alignments from translated documents. Translation memories (TMX files) also make great parallel data as they are already sentence segmented.
es: Con el fin de entrenar a los modelos de traducción automática no es suficiente sólo tener documentos traducidos. Los textos deben segmentarse en oraciones y alinearse. La alineación de texto paralelo es la identificación de las oraciones correspondientes a ambos lados del texto paralelo. Los documentos resultantes deben corresponder línea por línea o contener las oraciones originales y sus traducciones en la misma línea. `Hunalign <https://github.com/danielvarga/hunalign>`_ ayuda a crear alineaciones de oraciones a partir de documentos traducidos. Las memorias de traducción (archivos TMX) también hacen grandes datos paralelos, ya que ya están segmentados por oraciones.
tr: Makine çevirisi modellerini eğitmek için sadece tercüme edilmiş belgelere sahip olmak yeterli değildir. Metinlerin cümlelere bölünmesi ve hizalanması gerekir. Paralel metin hizalama, paralel metnin her iki yarısındaki karşılık gelen cümlelerin tanımlanmasıdır. Ortaya çıkan belgeler ya satır satır karşılık gelmeli ya da orijinal cümleleri ve çevirilerini aynı satırda içermelidir. `Hunalign <https://github.com/danielvarga/hunalign>`_ çevrilmiş belgelerden cümle hizalamaları oluşturmaya yardımcı olur.

source: Sourcing parallel data
es: Obtención de datos paralelos
tr: Paralel veri sağlama

source: `OPUS <https://opus.nlpl.eu/>`_ is a collection of almost all publicly available parallel data. It is the go-to point for many researchers to publish their parallel data or source data for development of MT models.
es: `OPUS <https://opus.nlpl.eu/>`_ es una recopilación de casi todos los datos paralelos disponibles públicamente. Es el punto de referencia para que muchos investigadores publiquen sus datos paralelos o datos de origen para el desarrollo de modelos de TA.
tr: `OPUS <https://opus.nlpl.eu/>`_ hemen hemen tüm kamuya açık paralel verilerin bir koleksiyonudur. MT modellerinin geliştirilmesi için birçok araştırmacının paralel verilerini veya kaynak verilerini yayınlaması için gidilecek noktadır.

source: Some common sources for parallel data are: - Multilingual web sites (e.g. international news outlets), - Movie subtitles (see `OpenSubtitles <https://opus.nlpl.eu/OpenSubtitles.php>`_), - Holy texts, - Parliament proceedings, - Software localization data.
es: Algunas fuentes comunes de datos paralelos son: - sitios web multilingües (por ejemplo, medios de comunicación internacionales), - subtítulos de películas (véase `OpenSubtitles <https://opus.nlpl.eu/OpenSubtitles.php>`_), - textos sagrados, - procedimientos parlamentarios, - datos de localización de software.
tr: Paralel veriler için bazı yaygın kaynaklar şunlardır: - Çok dilli web siteleri (örneğin uluslararası haber kuruluşları), - Film altyazıları (bkz. `OpenSubtitles <https://opus.nlpl.eu/OpenSubtitles.php>`_), - Kutsal metinler, - Parlamento işlemleri, - Yazılım yerelleştirme verileri.

source: Crowdsourcing parallel data with Tatoeba.org
es: Crowdsourcing de datos paralelos con Tatoeba.org
tr: Tatoeba ile kitle kaynaklı paralel veriler sağlama

source: Tatoeba is a free collection of example sentences with translations geared towards foreign language learners. It is written and maintained by a community of volunteers through a model of open collaboration. It is hosted by Tatoeba Association, a French non-profit organization funded through donations. It currently holds 10,397,308 sentences in 412 supported languages.
es: Tatoeba es una colección gratuita de oraciones de ejemplo con traducciones dirigidas a estudiantes de idiomas extranjeros. Está escrito y mantenido por una comunidad de voluntarios a través de un modelo de colaboración abierta. Está organizado por la Asociación Tatoeba, una organización francesa sin fines de lucro financiada mediante donaciones. Actualmente tiene 10.397.308 sentencias en 412 idiomas admitidos.
tr: Tatoeba, yabancı dil öğrenenlere yönelik çevirileri olan ücretsiz bir örnek cümleler topluluğudur. Bir açık işbirliği modeli aracılığıyla bir gönüllüler topluluğu tarafından yazılır ve sürdürülür. Bağışlarla finanse edilen Fransız kar amacı gütmeyen bir kuruluş olan Association Tatoeba tarafından düzenlenmektedir. Şu anda 412 desteklenen dilde 10.397.308 cümle barındırıyor.

source: A sentence and its translations from Tatoeba
es: Una frase y sus traducciones de Tatoeba
tr: Tatoeba’dan bir cümle ve çevirileri

source: Users can search for words in any language to retrieve sentences that use them. Each sentence in the Tatoeba database is displayed next to its likely translations in other languages; direct and indirect translations are differentiated. Sentences are tagged for content such as subject matter, dialect, or vulgarity; they also each have individual comment threads to facilitate feedback and corrections from other users and cultural notes. Sentences can be browsed by language, tag, and other criteria.
es: Los usuarios pueden buscar palabras en cualquier idioma para recuperar oraciones que las usen. Cada oración en la base de datos de Tatoeba se muestra junto a sus traducciones probables en otros idiomas; las traducciones directas e indirectas se diferencian. Las oraciones se etiquetan por contenido como tema, dialecto o vulgaridad; también tienen hilos de comentarios individuales para facilitar la retroalimentación y las correcciones de otros usuarios y notas culturales. Las oraciones se pueden examinar por idioma, etiqueta y otros criterios.
tr: Kullanıcılar, onları kullanan cümleleri almak için herhangi bir dilde kelimeleri arayabilir. Tatoeba veri tabanındaki her cümle, diğer dillerdeki olası çevirilerinin yanında görüntülenir; Doğrudan ve dolaylı çeviriler birbirinden ayrılır. Cümleler, konu, lehçe veya kabalık gibi içerik için etiketlenir; ayrıca diğer kullanıcılardan ve kültürel notlardan gelen geri bildirimleri ve düzeltmeleri kolaylaştırmak için her birinin ayrı yorum dizileri vardır. Cümleler dil, etiket ve diğer kriterlere göre taranabilir.

source: Registered users can add new sentences or translate or proofread existing ones, even if their target language is not their native tongue. However, users are encouraged to add original sentences or translations in their native or strongest language.
es: Los usuarios registrados pueden añadir nuevas frases o traducir o corregir las existentes, incluso si su idioma de destino no es su lengua materna. Sin embargo, se anima a los usuarios a añadir oraciones originales o traducciones en su idioma nativo o más fuerte.
tr: Kayıtlı kullanıcılar, hedef dilleri ana dilleri olmasa bile yeni cümleler ekleyebilir veya mevcut cümleleri çevirebilir veya düzeltebilir. Ancak, kullanıcıların kendi ana dillerinde veya en güçlü dillerinde orijinal cümleler veya çeviriler eklemeleri önerilir.

source: The entire Tatoeba database is published under a Creative Commons Attribution 2.0 license. It is also very easy to download parts of corpora in monolingual or parallel format from its `downloads page <https://tatoeba.org/en/downloads>`_.
es: Toda la base de datos Tatoeba se publica bajo una licencia Creative Commons Atribución 2.0. También es muy fácil descargar partes de corpus en formato monolingüe o paralelo desde su `página de descargas <https://tatoeba.org/en/downloads>`_.
tr: Tatoeba veritabanının tamamı Creative Commons Attribution 2.0 lisansı altında yayınlanmaktadır. Ayrıca, `indirmeler sayfasından <https://tatoeba.org/en/downloads>` corpora bölümlerini tek dilli veya paralel biçimde indirmek çok kolaydır.

source: Speech corpus
es: Corpus del habla
tr: Konuşma derlemi

source: A speech corpus is a collection of speech audio files usually accompanied with their text transcriptions. In speech technology, speech corpora are used to create acoustic models for tasks like automatic speech recognition, text-to-speech synthesis and also speaker identification.
es: Un corpus de voz es una colección de archivos de audio de voz que generalmente se acompañan con sus transcripciones de texto. En la tecnología del habla, los corpus del habla se utilizan para crear modelos acústicos para tareas como el reconocimiento automático de voz, la síntesis de texto a voz y también la identificación de altavoces.
tr: Bir konuşma derlemi, konuşma ses dosyalarının ve bunların metin transkripsiyonlarının bir koleksiyonudur. Konuşma teknolojisinde, otomatik konuşma tanıma, metin-konuşma sentezi ve ayrıca konuşmacı tanımlama gibi görevler için akustik modeller oluşturmak için konuşma derlemleri kullanılır.

source: Speech corpora can contain read (e.g. audiobooks, news, read numbers and words) or spontaneous speech (dialogues). Corpora adequeate for training ASR models contain samples from as many speakers as possible and in various acoustic settings (e.g. noisy, from far). In contrast, training data for TTS contains usually recordings from one speaker in an acoustically optimal setting.
es: Los corpus de habla pueden contener lectura (por ejemplo, audiolibros, noticias, números y palabras leídas) o habla espontánea (diálogos). El adequeato de corpus para los modelos ASR de entrenamiento contiene muestras de tantos altavoces como sea posible y en diversos entornos acústicos (por ejemplo, ruidoso, de lejos). Por el contrario, los datos de entrenamiento para TTS generalmente contienen grabaciones de un altavoz en un entorno acústicamente óptimo.
tr: Bir konuşma derlemi, konuşma koleksiyonlarının ve bir metin trans koleksiyonudur. Konuşma tasarımında konuşma tanıma, metin-konuşma sentezi ve genel gibi sınıflar için modeller oluşturmak için genel derlem.

source: `OpenSLR <https://www.openslr.org/resources.php>`_ lists many publicly available speech corpora.
es: `OpenSLR <https://www.openslr.org/resources.php>`_ lista muchos corpus de discursos disponibles públicamente.
tr: `OpenSLR <https://www.openslr.org/resources.php>`_ halka açık birçok konuşma derlemini listeler.
