Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/5-Case studies.po
Languages: es, tr

source: Billboard with "It's time the Internet speaks Catalan" being displayed on New York's Times Square (photo by Aina Martí)
es: Cartelera con "Es hora de que Internet hable catalán" que se exhibe en Times Square de Nueva York (foto de Aina Martí)
tr: New York Times Meydanı’nda “İnternet Katalanca konuşmanın zamanı geldi” yazan bir reklam panosu (fotoğraf Aina Martí tarafından)

source: Other initiatives
es: Otras iniciativas
tr: Diğer girişimler

source: Some other initiatives worth mentioning:
es: Otras iniciativas:
tr: Bahsetmeye değer diğer bazı girişimler:

source: Col·lectivaT has created `open speech data and text corpora for Catalan <https://collectivat.cat/rap>`_ using public television broadcasts and parlimantary proceedings.
es: Col·lectivaT ha creado `open speech data and text corpora for Catalan <https://collectivat.cat/rap>`_ utilizando emisiones de televisión pública y procedimientos parlimantarios.
tr: Col·lectivaT, kamu televizyon yayınlarını ve parlamento işlemlerini kullanarak “Katalanca <https://collectivat.cat/rap>” için “açık konuşma verileri ve metin derlemleri oluşturmuştur.

source: `Catotron <https://catotron.cat/>`_ is the first open-source, neural network-based speech synthesis engine for Catalan built with support from Department of Culture of Catalonia.
es: `Catotron <https://catotron.cat/>`_ es el primer motor de síntesis de voz de código abierto basado en una red neuronal para catalán construido con el apoyo del Departamento de Cultura de Cataluña.
tr: `Catotron <https://catotron.cat/>`_ Katalonya için Katalonya Kültür Departmanı’nın desteğiyle oluşturulmuş ilk açık kaynaklı, sinir ağı tabanlı konuşma sentez motorudur.

source: Cebuano and Waray-Waray, languages of Phillipines, has one of the biggest Wikipedia pages thanks to competitive usage of machine translation (`source <https://www.babbel.com/en/magazine/wikipedia-languages>`_)
es: Cebuano y Waray-Waray, idiomas de Filipinas, tiene una de las páginas de Wikipedia más grandes gracias al uso competitivo de la traducción automática (`source <https://www.babbel.com/en/magazine/wikipedia-languages>`_)
tr: Filipinler’in dilleri Cebuano ve Waray-Waray, makine çevirisinin rekabetçi kullanımı sayesinde en büyük Wikipedia sayfalarından birine sahiptir (`source <https://www.babbel.com/en/magazine/wikipedia-languages>`_)

source: Maori people have rejected both private and open-source initiatives for collecting voice data in their language in order to "maintain the right to self-determination" (`source <https://www.wired.co.uk/article/maori-language-tech>`_)
es: El pueblo maorí ha rechazado las iniciativas privadas y de código abierto para recopilar datos de voz en su idioma a fin de "mantener el derecho a la libre determinación" (`fuente <https://www.wired.co.uk/article/maori-language-tech>`_)
tr: Maori halkı, “kendi kaderini tayin hakkını korumak” için kendi dillerinde ses verileri toplamaya yönelik hem özel hem de açık kaynaklı girişimleri reddetti (`source <https://www.wired.co.uk/article/maori- dil teknolojisi>`_)

source: `A Manifesto for Open Language Technology <https://openlt.org/>`_
es: `Un Manifiesto para la Tecnología del Lenguaje Abierto <https://openlt.org/>`_
tr: `Açık Dil Teknolojisi Manifestosu <https://openlt.org/>`_

source: `ELLORA Enabling Low Resource Languages by Microsoft Research India <https://www.microsoft.com/en-us/research/project/ellora/>`_
es: `ELLORA habilitando idiomas de bajos recursos por Microsoft Research India <https://www.microsoft.com/en-us/research/project/ellora/>`_
tr: `ELLORA Microsoft Research Hindistan Tarafından Düşük Kaynaklı Dilleri Etkinleştiriyor <https://www.microsoft.com/en-us/research/project/ellora/>`_

source: This document was created with the financial support of the European Union. The content of this website is the sole responsibility of Col·lectivaT and SKAD and does not necessarily reflect the views of the European Union.
es: Este documento fue creado con el apoyo financiero de la Unión Europea. El contenido de este sitio web es responsabilidad exclusiva de Col·lectivaT y SKAD, y no refleja necesariamente las opiniones de la Unión Europea.
tr: Bu belge Avrupa Birliği’nin mali desteğiyle oluşturulmuştur. Bu web sitesinin içeriği yalnızca Col·lectivaT ve SKAD’ın sorumluluğundadır ve Avrupa Birliği’nin görüşlerini yansıtmayabilir.
