Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/5-Case studies.po
Languages: es, tr

source: Turkey and European Union flags
es: Banderas de Turquía y de la Unión Europea
tr: Türkiye ve Avrupa Birliği bayrakları

source: This project is funded by the European Union.
es: Este proyecto está financiado por la Unión Europea.
tr: Bu proje Avrupa Birliği tarafından finanse edilmektedir.

source: Case studies
es: Estudios de caso
tr: Örnek çalışmalar

source: In this section, we list some language technology-related initiatives and works that we deem exemplary or inspiring for endangered and minority languages. We will start with describing the project which gave fruit to this document "Judeo-Spanish: Connecting the two ends of the Mediterranean" and continue with projects that involve Anatolian, Iberian and African languages.
es: En esta sección, enumeramos algunas iniciativas y trabajos relacionados con la tecnología del lenguaje que consideramos ejemplares o inspiradores para las lenguas en peligro y minoritarias. Comenzaremos describiendo el proyecto que dio fruto a este documento "Judeo-Español: Conectando los dos extremos del Mediterráneo" y continuaremos con proyectos que involucran las lenguas anatólica, ibérica y africana.
tr: Bu bölümde, nesli tükenmekte olan ve azınlıklaştırılmış dilleri için örnek veya ilham verici olduğunu düşündüğümüz dil teknolojisi ile ilgili bazı girişimleri ve çalışmaları listeliyoruz. “Yahudi İspanyolcası: Akdeniz’in iki ucunu birbirine bağlamak” adlı bu belgeye meyve veren projeyi anlatarak başlayıp Anadolu, İber, Afrika dillerini içeren projelerle devam edeceğiz.

source: Judeo-Spanish: Connecting the two ends of the Mediterranean
es: Judeoespañol: Conectando las dos orrillas del Mediterráneo
tr: Judeoespanyol: Akdeniz’in iki ucunu birleştiren dil

source: Col·lectivaT and Sephardic Centre of Istanbul have come together for this project to carry out a diverse set of activities ranging from social media content creation to development of advanced language technology that assist Judeo-Spanish (Ladino) to the digital age. It also aimed to form awareness on this language as a common heritage between Turkey and Spain.
es: Col·lectivaT y el Centro Sefardí de Estambul se han unido para llevar a cabo un conjunto diverso de actividades que van desde la creación de contenidos en redes sociales hasta el desarrollo de tecnología lingüística avanzada que ayuda al judeoespañol (ladino) hasta la era digital. También pretendía dar a conocer esta lengua como patrimonio común entre Turquía y España.

source: Creation of audio-visual content for social media
es: Creación de contenidos audiovisuales para redes sociales
tr: Sosyal medya için görsel-işitsel içerik oluşturulması

source: The project created short language learning videos that would help gain visibility in social-media platforms and attract young generations to learn Ladino. In these short videos, a Judeo-Spanish phrase is presented with its translation in Turkish, English and Spanish with an audio helping to learn its pronuciation.
es: El proyecto creó videos cortos de aprendizaje de idiomas que ayudarían a ganar visibilidad en las plataformas de redes sociales y atraerían a las generaciones jóvenes a aprender ladino. En estos videos cortos, se presenta una frase judeo-española con su traducción en turco, inglés y español con un audio que ayuda a aprender su pronuciación.

source: Fraza del diya segments from SKAD's instagram page
es: Segmentos de Fraza del dia de la página de instagram de SKAD

source: Promoting Ladino on SKAD's instagram page with Fraza del diya (One sentence a day) videos
es: Promoción de Ladino en la página de Instagram de SKAD con vídeos de Fraza del diya (Una frase al día)
tr: Una Fraza al diya (Her güne bir cümle) videoları ile SKAD’ın instagram sayfasında Ladino’yu tanıtma

source: Ladino Data Hub and open language datasets
es: Ladino Data Hub y conjuntos de datos abiertos de lenguaje
tr: Ladino Data Hub ve açık dil veri kümeleri

source: The project launched `Ladino Data Hub <https://data.sefarad.com.tr/>`_ which will act as a centralized web archive dedicated to host Ladino language data and other resources that help document Sephardic culture. It aims to enable researchers, journalists from all over the world to access and share datasets that would help boost research and development for Ladino.
es: El proyecto lanzó `Ladino Data Hub <https://data.sefarad.com.tr/>`_ que actuará como un archivo web centralizado dedicado a alojar datos en idioma ladino y otros recursos que ayudan a documentar la cultura sefardí. Su objetivo es permitir a investigadores y periodistas de todo el mundo acceder y compartir conjuntos de datos que ayudarían a impulsar la investigación y el desarrollo de Ladino.
tr: Proje, Ladino dili verilerini ve Sefarad kültürünün belgelenmesine yardımcı olan diğer kaynakları barındırmaya ayrılmış merkezi bir web arşivi görevi görecek olan `Ladino Veri Merkezi’ni <https://data.sefarad.com.tr/>`_ başlattı. Dünyanın her yerinden araştırmacıların, gazetecilerin Ladino için araştırma ve geliştirmeyi artırmaya yardımcı olacak veri kümelerine erişmesini ve bunları paylaşmasını sağlamayı amaçlıyor.

source: Ladino data hub entry page with three of the datasets related to Ladino language
es: Página de entrada al centro de datos de Ladino con tres de los conjuntos de datos relacionados con el idioma ladino
tr: Ladino dili ile ilgili üç veri setini içeren Ladino veri merkezi giriş sayfası

source: Ladino Data Hub hosts data related to Ladino and Sephardic culture
es: Ladino Data Hub alberga datos relacionados con la cultura ladina y sefardí
tr: Ladino Data Hub, Ladino ve Sefarad kültürüyle ilgili verileri barındırır

source: The project created and repackaged already existing datasets and shared in this portal. These are:
es: El proyecto creó y reenvasó conjuntos de datos ya existentes y compartidos en este portal. Estos son:
tr: Proje, halihazırda var olan veri kümelerini oluşturup yeniden paketledi ve bu portalda paylaştı. Bunlar:

source: `A text corpus <https://data.sefarad.com.tr/dataset/salom-ladino-articles-text-corpus>`_ consisting of sentences crawled from `Şalom newspaper <https://www.salom.com.tr>`_.
es: `Un corpus de texto <https://data.sefarad.com.tr/dataset/salom-ladino-articles-text-corpus>`_ que consta de frases arrastradas desde el `periódico Şalom <https://www.salom.com.tr>`_.
tr: `Şalom gazetesinden <https://www.salom.com>`_ taranan cümlelerden oluşan bir `metin derlemi <https://data.sefarad.com.tr/dataset/salom-ladino-articles-text-corpus>`_

source: `A parallel text corpus with audio <https://data.sefarad.com.tr/dataset/una-fraza-al-diya-skad>`_ that contains Una Fraza al diya sentences and their audio
es: `Un corpus de texto paralelo con audio <https://data.sefarad.com.tr/dataset/una-fraza-al-diya-skad>`_ que contiene frases de Una Fraza al diya y su audio
tr: `Una Fraza al diya cümlelerini ve seslerini içeren <https://data.sefarad.com.tr/dataset/una-fraza-al-diya-skad>`_ sesli paralel metin bütünü

source: `Ladino speech corpus <https://data.sefarad.com.tr/dataset/ladino-speech>`_ created by SKAD
es: `Ladino speech corpus <https://data.sefarad.com.tr/dataset/ladino-speech>`_ creado por SKAD
tr: `Ladino konuşma derlemi <https://data.sefarad.com.tr/dataset/ladino-speech>`_ SKAD tarafından oluşturuldu

source: `Clean speech sythesis training dataset <https://data.sefarad.com.tr/dataset/tts-training-dataset>`_ consisting of read speech material by Karen Şarhon
es: `Conjunto de datos de entrenamiento de síntesis del habla limpia <https://data.sefarad.com.tr/dataset/tts-training-dataset>`_ consiste en material de habla leída por Karen Şarhon
tr: Karen Şarhon tarafından okunan konuşma materyalinden oluşan `temiz konuşma sentezi eğitim veri seti <https://data.sefarad.com.tr/dataset/tts-training-dataset>`_

source: `A Spanish Ladino lexicon <https://data.sefarad.com.tr/dataset/ladino-spanish-dictionary-files>`_ based on dictionary by Güler, Portal i Tinoco
es: `Un léxico ladino español <https://data.sefarad.com.tr/dataset/ladino-spanish-dictionary-files>`_ basado en el diccionario de Güler, Portal i Tinoco
tr: Güler’in sözlüğüne dayanan `İspanyolca Ladino sözlüğü <https://data.sefarad.com.tr/dataset/ladino-spanish-dictionary-files>`_

source: `Parallel texts in Ladino English and Turkish <https://data.sefarad.com.tr/dataset/skad-parallel>`_ from translations made within SKAD
es: `Textos paralelos en ladino, inglés y turco <https://data.sefarad.com.tr/dataset/skad-parallel>`_ a partir de las traducciones realizadad en SKAD
tr: `SKAD içinde yapılan çevirilerden `Ladino İngilizce ve Türkçe paralel metinler <https://data.sefarad.com.tr/dataset/skad-parallel>`_

source: `Synthetically produced parallel corpus <https://data.sefarad.com.tr/>`_ for training baseline MT models
es: `Corpus paralelo producido sintéticamente <https://data.sefarad.com.tr/>`_ para los modelos de MT de referencia de entrenamiento
tr: Temel MT modellerinin eğitimi için `sentetik olarak üretilmiş paralel derlem <https://data.sefarad.com.tr/>`_

source: Web application for machine translation and speech synthesis
es: Aplicación web para traducción automática y síntesis de voz
tr: Makine çevirisi ve konuşma sentezi için web uygulaması

source: The final and most important output of the project is a web application that is able to translate between Ladino and three related languages Turkish, Spanish and English. The objective is to help language learners, researchers and linguists who want to study Judeo-Spanish. The machine translation back-end was built with the help of a `rule based machine translation system <https://github.com/CollectivaT-dev/Espanyol-Ladino-Translation>`_ that can convert from Spanish to Ladino, getting use of the similar syntax between languages but changing ortography and vocabulary with a set of rules derived from dictionaries and grammar books. The web app is also able to synthesize Ladino sentences with a TTS application which was built with the `TTS training dataset <https://data.sefarad.com.tr/dataset/tts-training-dataset>`_.
es: El resultado final y más importante del proyecto es una aplicación web que es capaz de traducir entre ladino y tres idiomas relacionados turco, español e inglés. El objetivo es ayudar a los estudiantes de idiomas, investigadores y lingüistas que quieran estudiar judeo-español. El back-end de traducción automática se construyó con la ayuda de un `sistema de traducción automática basado en reglas <https://github.com/CollectivaT-dev/Espanyol-Ladino-Translation>`_ que puede convertir del español al ladino, utilizando la sintaxis similar entre idiomas pero cambiando la ortografía y el vocabulario con un conjunto de reglas derivadas de diccionarios y libros de gramática. La aplicación web también puede sintetizar oraciones ladinas con una aplicación TTS que se creó con el `conjunto de datos de capacitación TTS <https://data.sefarad.com.tr/dataset/tts-training-dataset>`_.
tr: Projenin son ve en önemli çıktısı, Ladino ile ilgili üç dil Türkçe, İspanyolca ve İngilizce arasında çeviri yapabilen bir web uygulamasıdır. Amaç, Judeo-İspanyolca öğrenmek isteyen dil öğrenenlere, araştırmacılara ve dilbilimcilere yardımcı olmaktır. Makine çevirisi arka ucu, İspanyolca’dan Ladino’ya dönüştürebilen `kural tabanlı bir makine çeviri sistemi <https://github.com/CollectivaT-dev/Espanyol-Ladino-Translation>`_ yardımıyla oluşturuldu. diller arasındaki benzer sözdiziminin, ancak sözlüklerden ve dilbilgisi kitaplarından türetilen bir dizi kuralla değişen yazım ve kelime dağarcığı. Web uygulaması ayrıca `TTS eğitim veri kümesi <https://data.sefarad.com.tr/dataset/tts-training-dataset>` ile oluşturulmuş bir TTS uygulaması ile Ladino cümlelerini sentezleyebilir.

source: Ladino translation web app with speech synthesis translating the sentence "Sara yemek pişirmeyi sevmez. Her zaman yemekleri yakar." to "A Sara no le plaze gizar. Siempre kema la komida."
es: Aplicación web de traducción Ladino con síntesis de voz traduciendo la frase "Sara yemek pişirmeyi sevmez. Su zaman yemekleri yakar." a “A Sara no le plaze gizar. El agua kema la komida a vezes.”
tr: Ladino çeviri web uygulaması konuşma sentezi ile “Sara yemek yemeyi sevmez. Her zaman yemeklerini yakar.” cümlesini çeviriyor. “A Sara no le plaze gizar. Siempre kema la komida.”

source: Ladino translation web app with speech synthesis
es: Aplicación web de traducción ladina con síntesis de voz
tr: Konuşma sentezi ile Ladino çeviri web uygulaması

source: The web application also allows contribution of parallel data. Users can load a random sentence and submit their corrected translation in order to extend the parallel data for Ladino.
es: La aplicación web también permite la contribución de datos paralelos. Los usuarios pueden cargar una oración aleatoria y enviar su traducción corregida para extender los datos paralelos para Ladino.
tr: Web uygulaması ayrıca paralel verilerin katkısına da izin verir. Kullanıcılar, Ladino için paralel verileri genişletmek için rastgele bir cümle yükleyebilir ve düzeltilmiş çevirilerini gönderebilir.

source: For a detailed technical report of this project, please refer the paper "Preparing an Endangered Language for the Digital Age: The Case of Judeo-Spanish" presented in the Workshop on Resources and Technologies for Indigenous, Endangered and Lesser-resourced Languages in Eurasia (`EURALI <https://sites.google.com/view/eurali/home?authuser=0>`_): *Link to be placed soon*
es: Para obtener un informe técnico detallado de este proyecto, consulte el documento "Preparando una Lengua en Peligro para la Era Digital: El Caso del Judeo-Español" presentado en el Taller sobre Recursos y Tecnologías para las Lenguas Indígenas, en Peligro y de Menores Recursos en Eurasia (`EURALI <https://sites.google.com/view/eurali/home?authuser=0>`_): *Enlace que se colocará pronto*
tr: Bu projenin ayrıntılı bir teknik raporu için lütfen Avrasya’da Yerli, Tehlikedeki ve Az Kaynaklı Diller için Kaynaklar ve Teknolojiler Çalıştayında sunulan “Dijital Çağ için Tehlike Altındaki Bir Dil Hazırlamak: Yahudi-İspanyolca Örneği” başlıklı makaleye bakın ( `EURALI <https://sites.google.com/view/eurali/home?authuser=0>`_): *Bağlantı yakında eklenecek*

source: Grassroots NLP communities
es: Comunidades de base PNL
tr: Taban NLP toplulukları

source: Against the NLP research focusing on a handful of languages, grassroots research communities organize together to bring the world's languages into the forefront of technology. Two examples of these initiatives are `Masakhane <https://www.masakhane.io/>`_ and `Turkic Interlingua <https://turkicinterlingua.org/>`_.
es: Contra la investigación de la PNL centrada en un puñado de idiomas, las comunidades de investigación de base se organizan para llevar los idiomas del mundo a la vanguardia de la tecnología. Dos ejemplos de estas iniciativas son `Masakhane <https://www.masakhane.io/>`_ y `Turkic Interlingua <https://turkicinterlingua.org/>`_.
tr: Bir avuç dile odaklanan NLP araştırmasına karşı, taban araştırma toplulukları, dünya dillerini teknolojinin ön saflarına getirmek için bir araya geliyor. Bu girişimlere iki örnek `Masakhane <https://www.masakhane.io/>`_ ve `Turkic Interlingua <https://turkicinterlingua.org/>`_.

source: As defined in their web-page, "Masakhane is a grassroots organisation whose mission is to strengthen and spur NLP research in African languages, for Africans, by Africans." It's an open-for-all initiative for "building together" as the meaning of their name suggests. Many concurrent activities take place by African and non-African researchers all over the world with the objective of representing the 2000 languages of Africa in language technology research. Some highlighting work from Masakhane are:
es: Como se define en su página web, "Masakhane es una organización de base cuya misión es fortalecer y estimular la investigación de PNL en idiomas africanos, para los africanos, por los africanos." Es una iniciativa abierta a todos para "construir juntos" como sugiere el significado de su nombre. Investigadores africanos y no africanos de todo el mundo llevan a cabo muchas actividades simultáneas con el objetivo de representar los 2000 idiomas de África en la investigación sobre tecnología lingüística. Algunos trabajos destacados de Masakhane son:
tr: Web sayfalarında tanımlandığı gibi, “Masakhane, misyonu Afrikalılar tarafından Afrikalılar için Afrika dillerinde NLP araştırmalarını güçlendirmek ve teşvik etmek olan bir taban örgütüdür.” Bu, adlarından da anlaşılacağı gibi “birlikte inşa etmek” için herkese açık bir girişimdir. Dil teknolojisi araştırmalarında Afrika’nın 2000 dilini temsil etmek amacıyla tüm dünyada Afrikalı ve Afrikalı olmayan araştırmacılar tarafından birçok eş zamanlı etkinlik gerçekleştirilmektedir. Masakhane’den öne çıkan bazı çalışmalar:

source: `Masakhane translator <http://translate.masakhane.io/>`_ supporting 6 African languages: Yoruba, Shona, Lingala, Swahili, Tshiluba
es: `Traductor Masakhane <http://translate.masakhane.io/>`_ apoyando 6 idiomas africanos: Yoruba, Shona, Lingala, Swahili, Tshiluba
tr: `Masakhane tercümanı <http://translate.masakhane.io/>`_ 6 Afrika dilini destekliyor: Yoruba, Shona, Lingala, Swahili, Tshiluba

source: `Lanfrica <https://lanfrica.com/>`_ cataloguing African language resources to counter difficulties encountered in discovering African language works
es: `Lanfrica <https://lanfrica.com/>`_ catalogación de recursos lingüísticos africanos para contrarrestar las dificultades encontradas en el descubrimiento de obras lingüísticas africanas
tr: `Lanfrica <https://lanfrica.com/>`_ Afrika dili eserlerini keşfetmede karşılaşılan zorluklara karşı koymak için Afrika dili kaynaklarını katalogluyor

source: `BibleTTS <https://masakhane-io.github.io/bibleTTS/>`_ unlocking the development of high-quality Text-to-Speech models for ten languages spoken in Sub-Saharan Africa: Ewe, Hausa, Kikuyu, Lingala, Luganda, Luo, Chichewa, Akuapem Twi, Asante Twi, Yoruba.
es: `BibleTTS <https://masakhane-io.github.io/bibleTTS/>`_ desbloquear el desarrollo de modelos de texto a voz de alta calidad para diez idiomas hablados en el África subsahariana: ewe, hausa, kikuyu, lingala, luganda, luo, chichewa, akuapem twi, asante twi, yoruba.
tr: `BibleTTS <https://masakhane-io.github.io/bibleTTS/>`_ Sahra Altı Afrika’da konuşulan on dil için yüksek kaliteli Metin Okuma modellerinin geliştirilmesini sağlıyor: Ewe, Hausa, Kikuyu, Lingala , Luganda, Luo, Chichewa, Akuapem Twi, Asante Twi, Yoruba.

source: `Machine translation for preserving Oshiwambo language and culture <https://openreview.net/forum?id=BFbg59zVUZc>`_
es: `Traducción automática para preservar el idioma y la cultura Oshiwambo <https://openreview.net/forum?id=BFbg59zVUZc>`_
tr: `Oshiwambo dilini ve kültürünü korumak için makine çevirisi <https://openreview.net/forum?id=BFbg59zVUZc>`_

source: `MasakhaNER Know our names <https://www.masakhane.io/ongoing-projects/masakhaner-know-our-names>`_ creating hand-crafted named entity recognition (NER) datasets for various African languages
es: `MasakhaNER Conozca nuestros nombres <https://www.masakhane.io/ongoing-projects/masakhaner-know-our-names>`_ creando conjuntos de datos de reconocimiento de entidades con nombre (Ner) hechos a mano para varios idiomas africanos
tr: `MasakhaNER İsimlerimizi bilin <https://www.masakhane.io/ongoing-projects/masakhaner-know-our-names>`_ çeşitli Afrika dilleri için el yapımı adlandırılmış varlık tanıma (NER) veri kümeleri oluşturma

source: Masakhane also organizes annual workshops for publishing research related to African NLP and participates in data collection funds like `Lacuna <https://lacunafund.org/>`_.
es: Masakhane también organiza talleres anuales para publicar investigaciones relacionadas con la PNL africana y participa en fondos de recopilación de datos como `Lacuna <https://lacunafund.org/>`_.
tr: Masakhane ayrıca Afrika NLP ile ilgili araştırmaları yayınlamak için yıllık çalıştaylar düzenler ve `Lacuna <https://lacunafund.org/>`_ gibi veri toplama fonlarına katılır.

source: **Turkic Interlingua (TIL)** is a "community of researchers, engineers, language enthusiasts and community leaders whose mission is to develop language technologies (from spell checkers to translation models), collect diverse datasets, and explore linguistic phenomena through the lens of academic research for Turkic languages" like Altai, Azerbaijani, Bashkir, Shor, Crimean Tatar, Chuvash, Gagauz, Karakalpak, Khakas, Kazakh, Karachay-Balkar, Kumyk, Kirghiz, Sakha (Yakut), Salar, Turkmen, Turkish, Tatar, Tuvinian, Uighur, Urum, and Uzbek.
es: **Turkic Interlingua (TIL)** es una "comunidad de investigadores, ingenieros, entusiastas del lenguaje y líderes comunitarios cuya misión es desarrollar tecnologías lingüísticas (desde correctores ortográficos hasta modelos de traducción), recopilar diversos conjuntos de datos y explorar fenómenos lingüísticos a través de la lente de la investigación académica para las lenguas túrquicas" como Altai, Azerbaijani, Bashkir, Shor, Crimean Tatar, Chuvash, Gagauz, Karakalpak, Khakas, Kazakhstan, Karachay-Balkar, Kumyk, Kirghiz, Sakha (Yakut), Salar, Turkmen, Turkish, Tatar, Tuvinian, Uighur, Urum y Uzbek.

source: Common Voice campaigns
es: Campañas de Common Voice
tr: Common Voice kampanyaları

source: Various language communities have embarked on mobilizing participation into Common Voice. These initiatives are prepared by groups ranging from single individuals to local governments. Some examples are:
es: Varias comunidades lingüísticas se han embarcado en la movilización de la participación en Common Voice. Estas iniciativas son preparadas por grupos que van desde individuos individuales hasta gobiernos locales. Algunos ejemplos son:
tr: Çeşitli dil toplulukları, Common Voice’a katılımı harekete geçirmeye başladı. Bu girişimler, tek tek bireylerden yerel yönetimlere kadar uzanan gruplar tarafından hazırlanmaktadır. Bazı örnekler:

source: `Igwebuike community <https://www.igwebuikecommunity.org/>`_ for Igbo
es: `Comunidad Igwebuike <https://www.igwebuikecommunity.org/>`_ para Igbo
tr: `Igwebuike topluluğu <https://www.igwebuikecommunity.org/>`_

source: `Projecte AINA <https://www.projecteaina.cat/>`_ for Catalan
es: `Proyecto AINA <https://www.projecteaina.cat/>`_ para catalán
tr: Katalanca için `AINA projesi <https://www.projecteaina.cat/>`_

source: We also would like to give a special mention to the Catalan community for their contribution to Common Voice. Being a stateless minority language in Spain, it's the 4th largest language (as of May 2022) in Common Voice thanks to the amazing contributions by activists and also a mobilization campaign by the `AI initiative of Catalan local government <https://www.projecteaina.cat/>`_.
es: También nos gustaría hacer una mención especial a la comunidad catalana por su contribución a Common Voice. Siendo una lengua minoritaria apátrida en España, es la cuarta lengua más grande (a partir de mayo de 2022) en Common Voice gracias a las increíbles contribuciones de los activistas y también a una campaña de movilización por parte de la `iniciativa de IA del gobierno local catalán <https://www.projecteaina.cat/>`_.
tr: Common Voice’a katkılarından dolayı Katalan topluluğuna da özel bir söz vermek istiyoruz. İspanya’da vatansız bir azınlık dili olan bu dil, aktivistlerin inanılmaz katkıları ve ayrıca Katalan yerel yönetiminin `AI girişiminin <https://www. projecteaina.cat/>`_.

source: Billboard with "It's time the Internet speaks Catalan" being displayed on New York's Times Square
es: Anuncio con "Es hora de que Internet hable catalán" que se exhibe en Times Square de Nueva York
tr: New York Times Meydanı’nda “İnternetin Katalanca konuşma zamanı geldi” yazılı pano
