Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/6-Good practices.po
Languages: es, tr

source: Turkey and European Union flags
es: Banderas de Turquía y de la Unión Europea
tr: Türkiye ve Avrupa Birliği bayrakları

source: This project is funded by the European Union.
es: Este proyecto está financiado por la Unión Europea.
tr: Bu proje Avrupa Birliği tarafından finanse edilmektedir.

source: Good practices
es: Prácticas más idóneas
tr: İyi uygulamalar

source: This section will be finalized with the feedback collected in the workshops organized during the project.
es: Esta sección se finalizará con los comentarios recogidos en los talleres organizados durante el proyecto.
tr: Bu bölüm, proje süresince düzenlenen çalıştaylarda toplanan geri bildirimlerle tamamlanacaktır.

source: While it is clear that a large number of languages in the world require intensive investment in resource creation for technology enablement, it seems highly unlikely that such an investment can be delivered readily and easily in a short span of time. Given these limited resources, language communities should be empowered to determine the future of their languages. In this document, we have presented how digital representation is part of this process.
es: Si bien es evidente que un gran número de idiomas en el mundo requieren una inversión intensiva en la creación de recursos para la habilitación tecnológica, parece muy poco probable que esa inversión pueda realizarse fácil y rápidamente en un corto período de tiempo. Dados estos recursos limitados, las comunidades lingüísticas deben estar facultadas para determinar el futuro de sus idiomas. En este documento, hemos presentado cómo la representación digital es parte de este proceso.
tr: Dünyada çok sayıda dilin teknolojiyi etkinleştirmek için kaynak yaratmaya yoğun yatırım gerektirdiği açık olsa da, böyle bir yatırımın kısa sürede kolayca ve kolayca teslim edilmesi pek olası görünmüyor. Bu sınırlı kaynaklar göz önüne alındığında, dil topluluklarına dillerinin geleceğini belirleme yetkisi verilmelidir. Bu belgede, dijital temsilin bu sürecin nasıl bir parçası olduğunu sunduk.

source: For deciding where to start, we suggest adopting the methodology of 4-D design thinking of *Discover, Design, Develop and Deploy* as introduced by Bali et al. in their `ELLORA initiative <https://www.microsoft.com/en-us/research/project/ellora/>`_. This user-centric approach is as follows:
es: Para decidir por dónde empezar, sugerimos adoptar la metodología del diseño 4-D pensando en *Descubrir, diseñar, desarrollar e implementar* como lo introdujo Bali et al. en su `iniciativa ELLORA <https://www.microsoft.com/en-us/research/project/ellora/>`_. Este enfoque centrado en el usuario es el siguiente:
tr: Nereden başlayacağınıza karar vermek için, Bali ve diğerlerinin `ELLORA girişimlerinde <https://www.microsoft.com/en-us/research/project/ellora/>`_ tanıtıldığı gibi Keşfet, Tasarla, Geliştir ve Dağıt’ın 4 boyutlu tasarım düşüncesini benimsemenizi öneririz. Bu kullanıcı merkezli yaklaşım aşağıdaki gibidir:

source: Discover what is most needed by the language community,
es: Descubre lo que más necesita la comunidad dewl idioma,

source: Design for the users and their language giving attention to diversity of the language and avoiding an approach parting from a majority language,
es: Diseñar para los usuarios y su lengua prestando atención a la diversidad de la lengua y evitando un enfoque que se aleje de una lengua mayoritaria,

source: Develop and deploy frequently in an interative manner constantly improving and detecting failures from the beginning.
es: Desarrollar e implementar con frecuencia de manera interactiva mejorando constantemente y detectando fallas desde el principio.
tr: Hataları baştan itibaren sürekli iyileştirerek ve tespit ederek etkileşimli bir şekilde sık sık geliştirin ve devreye alın.

source: Even when the community hasn't developed a perspective of language technology development, it is good practice to keep the value of data in mind when doing language preservation activities. Some examples of these are:
es: Incluso cuando la comunidad no ha desarrollado una perspectiva del desarrollo de la tecnología del lenguaje, es una buena práctica tener en cuenta el valor de los datos al realizar actividades de preservación del lenguaje. Algunos ejemplos de estos son:
tr: Topluluk, dil teknolojisi geliştirme perspektifi geliştirmemiş olsa bile, dil koruma etkinlikleri yaparken verilerin değerini akılda tutmak iyi bir uygulamadır. Bunlardan bazı örnekler:

source: Organize events and create content to raise data-awareness in the language community,
es: Organizar eventos y crear contenido para aumentar la conciencia de los datos en la comunidad lingüística,
tr: Dil topluluğunda veri farkındalığını artırmak için etkinlikler düzenlemek ve içerik oluşturmak,

source: Introduce languages to crowdsourcing platforms,
es: Introducir idiomas a las plataformas de crowdsourcing,

source: Organize datathons for language data collection,
es: Organizar datathons para la recopilación de datos de idioma,
tr: Dil verilerinin toplanması için veri topları düzenleyin,

source: Translate folk tales and children's stories which reside in public domain,
es: Traducir cuentos populares y cuentos infantiles que residen en el dominio público,

source: Store plain text or document versions of published material in order to create text corpora,
es: Almacenar versiones de texto plano o documentos de material publicado con el fin de crear corpus de texto,
tr: Metin derlemi oluşturmak için düz metin veya yayınlanmış materyalin belge versiyonlarını saklayın,

source: Save and openly share translation memories for helping other translators and for creating parallel data,
es: Guarde y comparta abiertamente las memorias de traducción para ayudar a otros traductores y para crear datos paralelos,
tr: Diğer çevirmenlere yardımcı olmak ve paralel veriler oluşturmak için çeviri belleklerini kaydedin ve açık bir şekilde paylaşın,

source: Store recordings of broadcast material (e.g. radioshows) and transcribe if possible so that they can be converted into speech data,
es: Almacenar grabaciones de material de radiodifusión (por ejemplo, programas de radio) y transcribirlas si es posible para que puedan convertirse en datos de voz,
tr: Yayın materyallerinin (örneğin radyo programları) kayıtlarını saklayın ve mümkünse konuşma verilerine dönüştürülebilmeleri için kopyalayın,

source: Save content published in social media to a permanent place so that they don't get lost in timelines.
es: Guarde el contenido publicado en las redes sociales en un lugar permanente para que no se pierdan en las líneas de tiempo.

source: *Do you have suggestions or questions? Write us at info-at-collectivat.cat*
es: *¿Tiene alguna sugerencia o pregunta? Escríbenos a info-arroba-collectivat.cat*
tr: *Önerileriniz veya sorularınız mı var? info-at-collectivat.cat adresinden bize yazın*

source: This document was created with the financial support of the European Union. The content of this website is the sole responsibility of Col·lectivaT and SKAD and does not necessarily reflect the views of the European Union.
es: Este documento fue creado con el apoyo financiero de la Unión Europea. El contenido de este sitio web es responsabilidad exclusiva de Col·lectivaT y SKAD, y no refleja necesariamente las opiniones de la Unión Europea.
tr: Bu belge Avrupa Birliği’nin mali desteğiyle oluşturulmuştur. Bu web sitesinin içeriği yalnızca Col·lectivaT ve SKAD’ın sorumluluğundadır ve Avrupa Birliği’nin görüşlerini yansıtmayabilir.
