Repository: CollectivaT-dev/language-toolkit
Catalog: docs/source/locales/*/LC_MESSAGES/index.po
Languages: es

source: Contents
es: Índice

source: Turkey and European Union flags
es: Banderas de Turquía y de la Unión Europea

source: This project is funded by the European Union.
es: Este proyecto está financiado por la Unión Europea.

source: Toolkit for marginalized and under-resourced languages
es: Kit de herramientas para idiomas minorizadas y de bajos recursos

source: In this document we cover the role of technology, with a focus on artificial intelligence-based technology, on the preservation of endangered languages.
es: En este documento cubrimos el papel de la tecnología, con un enfoque en la tecnología basada en la inteligencia artificial, en la preservación de lenguajes en peligro de extinción.

source: This is a living document that was created as part of the project "Judeo-Spanish: Connecting the two ends of the Mediterranean" carried out by Col·lectivaT and Sephardic Center of Istanbul (SKAD) within the framework of the "Grant Scheme for Common Cultural Heritage: Preservation and Dialogue between Turkey and the EU–II (CCH-II)" implemented by the Ministry of Culture and Tourism of the Republic of Turkey with the financial support of the European Union.
es: Este es un documento vivo que fue creado como parte del proyecto "Judeoespañol: Conectando las dos orrillas del Mediterráneo" llevado a cabo por Col·lectivaT y el Centro Sefardí de Estambul (SKAD) en el marco del "Programa de Subvenciones para el Patrimonio Cultural Común: Preservación y Diálogo entre Turquía y la UE-II (CCH-II)" implementado por el Ministerio de Cultura y Turismo de la República de Turquía con el apoyo financiero de la Unión Europea.

source: This document is also available in Turkish and Spanish.
es: Este documento también está disponible en inglés y turco.

source: License
es: Licencia

source: This document is licensed with `Attribution 4.0 International (CC BY 4.0) <https://creativecommons.org/licenses/by/4.0/>`_
es: Este documento está licenciado con `Atribución 4.0 Internacional (CC BY 4.0) <https://creativecommons.org/licenses/by/4.0/>`_

source: This document was created with the financial support of the European Union. The content of this website is the sole responsibility of Col·lectivaT and SKAD and does not necessarily reflect the views of the European Union.
es: Este documento fue creado con el apoyo financiero de la Unión Europea. El contenido de este sitio web es responsabilidad exclusiva de Col·lectivaT y SKAD, y no refleja necesariamente las opiniones de la Unión Europea.
